stm32duino/Arduino_Core_STM32/boards.txt
# Generic F031C4Tx
GenF0.menu.pnum.GENERIC_F031C4TX=Generic F031C4Tx
GenF0.menu.pnum.GENERIC_F031C4TX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F031C4TX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031C4TX.build.board=GENERIC_F031C4TX
GenF0.menu.pnum.GENERIC_F031C4TX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031C4TX.build.variant=STM32F0xx/F031C(4-6)T

# Generic F031C6Tx
GenF0.menu.pnum.GENERIC_F031C6TX=Generic F031C6Tx
GenF0.menu.pnum.GENERIC_F031C6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031C6TX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031C6TX.build.board=GENERIC_F031C6TX
GenF0.menu.pnum.GENERIC_F031C6TX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031C6TX.build.variant=STM32F0xx/F031C(4-6)T

# Generic F031E6Yx
GenF0.menu.pnum.GENERIC_F031E6YX=Generic F031E6Yx
GenF0.menu.pnum.GENERIC_F031E6YX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031E6YX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031E6YX.build.board=GENERIC_F031E6YX
GenF0.menu.pnum.GENERIC_F031E6YX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031E6YX.build.variant=STM32F0xx/F031E6Y_F038E6Y

# Generic F031F4Px
GenF0.menu.pnum.GENERIC_F031F4PX=Generic F031F4Px
GenF0.menu.pnum.GENERIC_F031F4PX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F031F4PX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031F4PX.build.board=GENERIC_F031F4PX
GenF0.menu.pnum.GENERIC_F031F4PX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031F4PX.build.variant=STM32F0xx/F031F(4-6)P

# Generic F031F6Px
GenF0.menu.pnum.GENERIC_F031F6PX=Generic F031F6Px
GenF0.menu.pnum.GENERIC_F031F6PX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031F6PX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031F6PX.build.board=GENERIC_F031F6PX
GenF0.menu.pnum.GENERIC_F031F6PX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031F6PX.build.variant=STM32F0xx/F031F(4-6)P

# Generic F031G4Ux
GenF0.menu.pnum.GENERIC_F031G4UX=Generic F031G4Ux
GenF0.menu.pnum.GENERIC_F031G4UX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F031G4UX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031G4UX.build.board=GENERIC_F031G4UX
GenF0.menu.pnum.GENERIC_F031G4UX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031G4UX.build.variant=STM32F0xx/F031G(4-6)U

# Generic F031G6Ux
GenF0.menu.pnum.GENERIC_F031G6UX=Generic F031G6Ux
GenF0.menu.pnum.GENERIC_F031G6UX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031G6UX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031G6UX.build.board=GENERIC_F031G6UX
GenF0.menu.pnum.GENERIC_F031G6UX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031G6UX.build.variant=STM32F0xx/F031G(4-6)U

# Generic F031K4Ux
GenF0.menu.pnum.GENERIC_F031K4UX=Generic F031K4Ux
GenF0.menu.pnum.GENERIC_F031K4UX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F031K4UX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031K4UX.build.board=GENERIC_F031K4UX
GenF0.menu.pnum.GENERIC_F031K4UX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031K4UX.build.variant=STM32F0xx/F031K(4-6)U

# Generic F031K6Tx
GenF0.menu.pnum.GENERIC_F031K6TX=Generic F031K6Tx
GenF0.menu.pnum.GENERIC_F031K6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031K6TX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031K6TX.build.board=GENERIC_F031K6TX
GenF0.menu.pnum.GENERIC_F031K6TX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031K6TX.build.variant=STM32F0xx/F031K6T

# Generic F031K6Ux
GenF0.menu.pnum.GENERIC_F031K6UX=Generic F031K6Ux
GenF0.menu.pnum.GENERIC_F031K6UX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031K6UX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031K6UX.build.board=GENERIC_F031K6UX
GenF0.menu.pnum.GENERIC_F031K6UX.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031K6UX.build.variant=STM32F0xx/F031K(4-6)U

# Generic F038C6Tx
GenF0.menu.pnum.GENERIC_F038C6TX=Generic F038C6Tx
GenF0.menu.pnum.GENERIC_F038C6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F038C6TX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F038C6TX.build.board=GENERIC_F038C6TX
GenF0.menu.pnum.GENERIC_F038C6TX.build.product_line=STM32F038xx
GenF0.menu.pnum.GENERIC_F038C6TX.build.variant=STM32F0xx/F038C6T

# Generic F038E6Yx
GenF0.menu.pnum.GENERIC_F038E6YX=Generic F038E6Yx
GenF0.menu.pnum.GENERIC_F038E6YX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F038E6YX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F038E6YX.build.board=GENERIC_F038E6YX
GenF0.menu.pnum.GENERIC_F038E6YX.build.product_line=STM32F038xx
GenF0.menu.pnum.GENERIC_F038E6YX.build.variant=STM32F0xx/F031E6Y_F038E6Y

# Generic F038F6Px
GenF0.menu.pnum.GENERIC_F038F6PX=Generic F038F6Px
GenF0.menu.pnum.GENERIC_F038F6PX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F038F6PX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F038F6PX.build.board=GENERIC_F038F6PX
GenF0.menu.pnum.GENERIC_F038F6PX.build.product_line=STM32F038xx
GenF0.menu.pnum.GENERIC_F038F6PX.build.variant=STM32F0xx/F038F6P

# Generic F038G6Ux
GenF0.menu.pnum.GENERIC_F038G6UX=Generic F038G6Ux
GenF0.menu.pnum.GENERIC_F038G6UX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F038G6UX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F038G6UX.build.board=GENERIC_F038G6UX
GenF0.menu.pnum.GENERIC_F038G6UX.build.product_line=STM32F038xx
GenF0.menu.pnum.GENERIC_F038G6UX.build.variant=STM32F0xx/F038G6U

# Generic F038K6Ux
GenF0.menu.pnum.GENERIC_F038K6UX=Generic F038K6Ux
GenF0.menu.pnum.GENERIC_F038K6UX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F038K6UX.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F038K6UX.build.board=GENERIC_F038K6UX
GenF0.menu.pnum.GENERIC_F038K6UX.build.product_line=STM32F038xx
GenF0.menu.pnum.GENERIC_F038K6UX.build.variant=STM32F0xx/F038K6U

# Generic F042C4Tx
GenF0.menu.pnum.GENERIC_F042C4TX=Generic F042C4Tx
GenF0.menu.pnum.GENERIC_F042C4TX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F042C4TX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042C4TX.build.board=GENERIC_F042C4TX
GenF0.menu.pnum.GENERIC_F042C4TX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042C4TX.build.variant=STM32F0xx/F042C(4-6)(T-U)

# Generic F042C6Tx
GenF0.menu.pnum.GENERIC_F042C6TX=Generic F042C6Tx
GenF0.menu.pnum.GENERIC_F042C6TX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F042C6TX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042C6TX.build.board=GENERIC_F042C6TX
GenF0.menu.pnum.GENERIC_F042C6TX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042C6TX.build.variant=STM32F0xx/F042C(4-6)(T-U)

# Generic F042C4Ux
GenF0.menu.pnum.GENERIC_F042C4UX=Generic F042C4Ux
GenF0.menu.pnum.GENERIC_F042C4UX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F042C4UX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042C4UX.build.board=GENERIC_F042C4UX
GenF0.menu.pnum.GENERIC_F042C4UX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042C4UX.build.variant=STM32F0xx/F042C(4-6)(T-U)

# Generic F042C6Ux
GenF0.menu.pnum.GENERIC_F042C6UX=Generic F042C6Ux
GenF0.menu.pnum.GENERIC_F042C6UX.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F042C6UX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042C6UX.build.board=GENERIC_F042C6UX
GenF0.menu.pnum.GENERIC_F042C6UX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042C6UX.build.variant=STM32F0xx/F042C(4-6)(T-U)

# Generic F042F4Px
GenF0.menu.pnum.GENERIC_F042F4PX=Generic F042F4Px
GenF0.menu.pnum.GENERIC_F042F4PX.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F042F4PX.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042F4PX.build.board=GENERIC_F042F4PX
GenF0.menu.pnum.GENERIC_F042F4PX.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042F4PX.build.variant=STM32F0xx/F042F(4-6)P

