stm32duino/Arduino_Core_STM32/boards.txt
# Generic F070CBTx
GenF0.menu.pnum.GENERIC_F070CBTX=Generic F070CBTx
GenF0.menu.pnum.GENERIC_F070CBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F070CBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F070CBTX.build.board=GENERIC_F070CBTX
GenF0.menu.pnum.GENERIC_F070CBTX.build.product_line=STM32F070xB
GenF0.menu.pnum.GENERIC_F070CBTX.build.variant=STM32F0xx/F070CBT

# Generic F070RBTx
GenF0.menu.pnum.GENERIC_F070RBTX=Generic F070RBTx
GenF0.menu.pnum.GENERIC_F070RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F070RBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F070RBTX.build.board=GENERIC_F070RBTX
GenF0.menu.pnum.GENERIC_F070RBTX.build.product_line=STM32F070xB
GenF0.menu.pnum.GENERIC_F070RBTX.build.variant=STM32F0xx/F070RBT

# Generic F071C8Tx
GenF0.menu.pnum.GENERIC_F071C8TX=Generic F071C8Tx
GenF0.menu.pnum.GENERIC_F071C8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F071C8TX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F071C8TX.build.board=GENERIC_F071C8TX
GenF0.menu.pnum.GENERIC_F071C8TX.build.product_line=STM32F071xB
GenF0.menu.pnum.GENERIC_F071C8TX.build.variant=STM32F0xx/F071C8(T-U)_F071CB(T-U-Y)

# Generic F071CBTx
GenF0.menu.pnum.GENERIC_F071CBTX=Generic F071CBTx
GenF0.menu.pnum.GENERIC_F071CBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F071CBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F071CBTX.build.board=GENERIC_F071CBTX
GenF0.menu.pnum.GENERIC_F071CBTX.build.product_line=STM32F071xB
GenF0.menu.pnum.GENERIC_F071CBTX.build.variant=STM32F0xx/F071C8(T-U)_F071CB(T-U-Y)

# Generic F071C8Ux
GenF0.menu.pnum.GENERIC_F071C8UX=Generic F071C8Ux
GenF0.menu.pnum.GENERIC_F071C8UX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F071C8UX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F071C8UX.build.board=GENERIC_F071C8UX
GenF0.menu.pnum.GENERIC_F071C8UX.build.product_line=STM32F071xB
GenF0.menu.pnum.GENERIC_F071C8UX.build.variant=STM32F0xx/F071C8(T-U)_F071CB(T-U-Y)

# Generic F071CBUx
GenF0.menu.pnum.GENERIC_F071CBUX=Generic F071CBUx
GenF0.menu.pnum.GENERIC_F071CBUX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F071CBUX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F071CBUX.build.board=GENERIC_F071CBUX
GenF0.menu.pnum.GENERIC_F071CBUX.build.product_line=STM32F071xB
GenF0.menu.pnum.GENERIC_F071CBUX.build.variant=STM32F0xx/F071C8(T-U)_F071CB(T-U-Y)

# Generic F071CBYx
GenF0.menu.pnum.GENERIC_F071CBYX=Generic F071CBYx
GenF0.menu.pnum.GENERIC_F071CBYX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F071CBYX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F071CBYX.build.board=GENERIC_F071CBYX
GenF0.menu.pnum.GENERIC_F071CBYX.build.product_line=STM32F071xB
GenF0.menu.pnum.GENERIC_F071CBYX.build.variant=STM32F0xx/F071C8(T-U)_F071CB(T-U-Y)

# Generic F071RBTx
GenF0.menu.pnum.GENERIC_F071RBTX=Generic F071RBTx
GenF0.menu.pnum.GENERIC_F071RBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F071RBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F071RBTX.build.board=GENERIC_F071RBTX
GenF0.menu.pnum.GENERIC_F071RBTX.build.product_line=STM32F071xB
GenF0.menu.pnum.GENERIC_F071RBTX.build.variant=STM32F0xx/F071RBT

# Generic F071V8Hx
GenF0.menu.pnum.GENERIC_F071V8HX=Generic F071V8Hx
GenF0.menu.pnum.GENERIC_F071V8HX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F071V8HX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F071V8HX.build.board=GENERIC_F071V8HX
GenF0.menu.pnum.GENERIC_F071V8HX.build.product_line=STM32F071xB
GenF0.menu.pnum.GENERIC_F071V8HX.build.variant=STM32F0xx/F071V(8-B)(H-T)

# Generic F071VBHx
GenF0.menu.pnum.GENERIC_F071VBHX=Generic F071VBHx
GenF0.menu.pnum.GENERIC_F071VBHX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F071VBHX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F071VBHX.build.board=GENERIC_F071VBHX
GenF0.menu.pnum.GENERIC_F071VBHX.build.product_line=STM32F071xB
GenF0.menu.pnum.GENERIC_F071VBHX.build.variant=STM32F0xx/F071V(8-B)(H-T)

# Generic F071V8Tx
GenF0.menu.pnum.GENERIC_F071V8TX=Generic F071V8Tx
GenF0.menu.pnum.GENERIC_F071V8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F071V8TX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F071V8TX.build.board=GENERIC_F071V8TX
GenF0.menu.pnum.GENERIC_F071V8TX.build.product_line=STM32F071xB
GenF0.menu.pnum.GENERIC_F071V8TX.build.variant=STM32F0xx/F071V(8-B)(H-T)

# Generic F071VBTx
GenF0.menu.pnum.GENERIC_F071VBTX=Generic F071VBTx
GenF0.menu.pnum.GENERIC_F071VBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F071VBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F071VBTX.build.board=GENERIC_F071VBTX
GenF0.menu.pnum.GENERIC_F071VBTX.build.product_line=STM32F071xB
GenF0.menu.pnum.GENERIC_F071VBTX.build.variant=STM32F0xx/F071V(8-B)(H-T)

# Generic F072C8Tx
GenF0.menu.pnum.GENERIC_F072C8TX=Generic F072C8Tx
GenF0.menu.pnum.GENERIC_F072C8TX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072C8TX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072C8TX.build.board=GENERIC_F072C8TX
GenF0.menu.pnum.GENERIC_F072C8TX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072C8TX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)

# Generic F072CBTx
GenF0.menu.pnum.GENERIC_F072CBTX=Generic F072CBTx
GenF0.menu.pnum.GENERIC_F072CBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072CBTX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072CBTX.build.board=GENERIC_F072CBTX
GenF0.menu.pnum.GENERIC_F072CBTX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072CBTX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)

# Generic F072C8Ux
GenF0.menu.pnum.GENERIC_F072C8UX=Generic F072C8Ux
GenF0.menu.pnum.GENERIC_F072C8UX.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072C8UX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072C8UX.build.board=GENERIC_F072C8UX
GenF0.menu.pnum.GENERIC_F072C8UX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072C8UX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)

# Generic F072CBUx
GenF0.menu.pnum.GENERIC_F072CBUX=Generic F072CBUx
GenF0.menu.pnum.GENERIC_F072CBUX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072CBUX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072CBUX.build.board=GENERIC_F072CBUX
GenF0.menu.pnum.GENERIC_F072CBUX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072CBUX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)

# Generic F072CBYx
GenF0.menu.pnum.GENERIC_F072CBYX=Generic F072CBYx
GenF0.menu.pnum.GENERIC_F072CBYX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072CBYX.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072CBYX.build.board=GENERIC_F072CBYX
GenF0.menu.pnum.GENERIC_F072CBYX.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072CBYX.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)

