stm32duino/Arduino_Core_STM32/boards.txt
# Generic F091RCHx
GenF0.menu.pnum.GENERIC_F091RCHX=Generic F091RCHx
GenF0.menu.pnum.GENERIC_F091RCHX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091RCHX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RCHX.build.board=GENERIC_F091RCHX
GenF0.menu.pnum.GENERIC_F091RCHX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RCHX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)

# Generic F091RCYx
GenF0.menu.pnum.GENERIC_F091RCYX=Generic F091RCYx
GenF0.menu.pnum.GENERIC_F091RCYX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091RCYX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091RCYX.build.board=GENERIC_F091RCYX
GenF0.menu.pnum.GENERIC_F091RCYX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091RCYX.build.variant=STM32F0xx/F091RBT_F091RC(H-T-Y)

# Generic F091VBTx
GenF0.menu.pnum.GENERIC_F091VBTX=Generic F091VBTx
GenF0.menu.pnum.GENERIC_F091VBTX.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F091VBTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091VBTX.build.board=GENERIC_F091VBTX
GenF0.menu.pnum.GENERIC_F091VBTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091VBTX.build.variant=STM32F0xx/F091VBT_F091VC(H-T)

# Generic F091VCTx
GenF0.menu.pnum.GENERIC_F091VCTX=Generic F091VCTx
GenF0.menu.pnum.GENERIC_F091VCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091VCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091VCTX.build.board=GENERIC_F091VCTX
GenF0.menu.pnum.GENERIC_F091VCTX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091VCTX.build.variant=STM32F0xx/F091VBT_F091VC(H-T)

# Generic F091VCHx
GenF0.menu.pnum.GENERIC_F091VCHX=Generic F091VCHx
GenF0.menu.pnum.GENERIC_F091VCHX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F091VCHX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F091VCHX.build.board=GENERIC_F091VCHX
GenF0.menu.pnum.GENERIC_F091VCHX.build.product_line=STM32F091xC
GenF0.menu.pnum.GENERIC_F091VCHX.build.variant=STM32F0xx/F091VBT_F091VC(H-T)

# Generic F098CCTx
GenF0.menu.pnum.GENERIC_F098CCTX=Generic F098CCTx
GenF0.menu.pnum.GENERIC_F098CCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098CCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098CCTX.build.board=GENERIC_F098CCTX
GenF0.menu.pnum.GENERIC_F098CCTX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098CCTX.build.variant=STM32F0xx/F098CC(T-U)

# Generic F098CCUx
GenF0.menu.pnum.GENERIC_F098CCUX=Generic F098CCUx
GenF0.menu.pnum.GENERIC_F098CCUX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098CCUX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098CCUX.build.board=GENERIC_F098CCUX
GenF0.menu.pnum.GENERIC_F098CCUX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098CCUX.build.variant=STM32F0xx/F098CC(T-U)

# Generic F098RCHx
GenF0.menu.pnum.GENERIC_F098RCHX=Generic F098RCHx
GenF0.menu.pnum.GENERIC_F098RCHX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098RCHX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098RCHX.build.board=GENERIC_F098RCHX
GenF0.menu.pnum.GENERIC_F098RCHX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098RCHX.build.variant=STM32F0xx/F098RC(H-T-Y)

# Generic F098RCTx
GenF0.menu.pnum.GENERIC_F098RCTX=Generic F098RCTx
GenF0.menu.pnum.GENERIC_F098RCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098RCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098RCTX.build.board=GENERIC_F098RCTX
GenF0.menu.pnum.GENERIC_F098RCTX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098RCTX.build.variant=STM32F0xx/F098RC(H-T-Y)

# Generic F098RCYx
GenF0.menu.pnum.GENERIC_F098RCYX=Generic F098RCYx
GenF0.menu.pnum.GENERIC_F098RCYX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098RCYX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098RCYX.build.board=GENERIC_F098RCYX
GenF0.menu.pnum.GENERIC_F098RCYX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098RCYX.build.variant=STM32F0xx/F098RC(H-T-Y)

# Generic F098VCHx
GenF0.menu.pnum.GENERIC_F098VCHX=Generic F098VCHx
GenF0.menu.pnum.GENERIC_F098VCHX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098VCHX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098VCHX.build.board=GENERIC_F098VCHX
GenF0.menu.pnum.GENERIC_F098VCHX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098VCHX.build.variant=STM32F0xx/F098VC(H-T)

# Generic F098VCTx
GenF0.menu.pnum.GENERIC_F098VCTX=Generic F098VCTx
GenF0.menu.pnum.GENERIC_F098VCTX.upload.maximum_size=262144
GenF0.menu.pnum.GENERIC_F098VCTX.upload.maximum_data_size=32768
GenF0.menu.pnum.GENERIC_F098VCTX.build.board=GENERIC_F098VCTX
GenF0.menu.pnum.GENERIC_F098VCTX.build.product_line=STM32F098xx
GenF0.menu.pnum.GENERIC_F098VCTX.build.variant=STM32F0xx/F098VC(H-T)

# Upload menu
GenF0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF0.menu.upload_method.swdMethod.upload.protocol=0
GenF0.menu.upload_method.swdMethod.upload.options=
GenF0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF0.menu.upload_method.serialMethod.upload.protocol=1
GenF0.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF0.menu.upload_method.dfuMethod.upload.protocol=2
GenF0.menu.upload_method.dfuMethod.upload.options=
GenF0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic F1
GenF1.name=Generic STM32F1 series

GenF1.build.core=arduino
GenF1.build.board=GenF1
GenF1.build.mcu=cortex-m3
GenF1.build.series=STM32F1xx
GenF1.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF1.build.flash_offset=0x0
GenF1.upload.maximum_size=0
GenF1.upload.maximum_data_size=0

# BLUEPILL_F103C6 board
GenF1.menu.pnum.BLUEPILL_F103C6=BluePill F103C6 (32K)
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_size=32768
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_data_size=10240
GenF1.menu.pnum.BLUEPILL_F103C6.build.board=BLUEPILL_F103C6
GenF1.menu.pnum.BLUEPILL_F103C6.build.product_line=STM32F103x6
GenF1.menu.pnum.BLUEPILL_F103C6.build.variant=STM32F1xx/F103C4T_F103C6(T-U)
GenF1.menu.pnum.BLUEPILL_F103C6.build.variant_h=variant_{build.board}.h

