stm32duino/Arduino_Core_STM32/boards.txt
# Generic F205VFTx
GenF2.menu.pnum.GENERIC_F205VFTX=Generic F205VFTx
GenF2.menu.pnum.GENERIC_F205VFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F205VFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205VFTX.build.board=GENERIC_F205VFTX
GenF2.menu.pnum.GENERIC_F205VFTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205VFTX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T

# Generic F205VGTx
GenF2.menu.pnum.GENERIC_F205VGTX=Generic F205VGTx
GenF2.menu.pnum.GENERIC_F205VGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F205VGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205VGTX.build.board=GENERIC_F205VGTX
GenF2.menu.pnum.GENERIC_F205VGTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205VGTX.build.variant=STM32F2xx/F205V(B-C-E-F-G)T_F215V(E-G)T

# Generic F205ZCTx
GenF2.menu.pnum.GENERIC_F205ZCTX=Generic F205ZCTx
GenF2.menu.pnum.GENERIC_F205ZCTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F205ZCTX.upload.maximum_data_size=98304
GenF2.menu.pnum.GENERIC_F205ZCTX.build.board=GENERIC_F205ZCTX
GenF2.menu.pnum.GENERIC_F205ZCTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205ZCTX.build.variant=STM32F2xx/F205Z(C-E-F-G)T_F215Z(E-G)T

# Generic F205ZETx
GenF2.menu.pnum.GENERIC_F205ZETX=Generic F205ZETx
GenF2.menu.pnum.GENERIC_F205ZETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F205ZETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205ZETX.build.board=GENERIC_F205ZETX
GenF2.menu.pnum.GENERIC_F205ZETX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205ZETX.build.variant=STM32F2xx/F205Z(C-E-F-G)T_F215Z(E-G)T

# Generic F205ZFTx
GenF2.menu.pnum.GENERIC_F205ZFTX=Generic F205ZFTx
GenF2.menu.pnum.GENERIC_F205ZFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F205ZFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205ZFTX.build.board=GENERIC_F205ZFTX
GenF2.menu.pnum.GENERIC_F205ZFTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205ZFTX.build.variant=STM32F2xx/F205Z(C-E-F-G)T_F215Z(E-G)T

# Generic F205ZGTx
GenF2.menu.pnum.GENERIC_F205ZGTX=Generic F205ZGTx
GenF2.menu.pnum.GENERIC_F205ZGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F205ZGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F205ZGTX.build.board=GENERIC_F205ZGTX
GenF2.menu.pnum.GENERIC_F205ZGTX.build.product_line=STM32F205xx
GenF2.menu.pnum.GENERIC_F205ZGTX.build.variant=STM32F2xx/F205Z(C-E-F-G)T_F215Z(E-G)T

# Generic F207ICHx
GenF2.menu.pnum.GENERIC_F207ICHX=Generic F207ICHx
GenF2.menu.pnum.GENERIC_F207ICHX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F207ICHX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ICHX.build.board=GENERIC_F207ICHX
GenF2.menu.pnum.GENERIC_F207ICHX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ICHX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)

# Generic F207IEHx
GenF2.menu.pnum.GENERIC_F207IEHX=Generic F207IEHx
GenF2.menu.pnum.GENERIC_F207IEHX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F207IEHX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IEHX.build.board=GENERIC_F207IEHX
GenF2.menu.pnum.GENERIC_F207IEHX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IEHX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)

# Generic F207IFHx
GenF2.menu.pnum.GENERIC_F207IFHX=Generic F207IFHx
GenF2.menu.pnum.GENERIC_F207IFHX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F207IFHX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IFHX.build.board=GENERIC_F207IFHX
GenF2.menu.pnum.GENERIC_F207IFHX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IFHX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)

# Generic F207IGHx
GenF2.menu.pnum.GENERIC_F207IGHX=Generic F207IGHx
GenF2.menu.pnum.GENERIC_F207IGHX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F207IGHX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IGHX.build.board=GENERIC_F207IGHX
GenF2.menu.pnum.GENERIC_F207IGHX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IGHX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)

# Generic F207ICTx
GenF2.menu.pnum.GENERIC_F207ICTX=Generic F207ICTx
GenF2.menu.pnum.GENERIC_F207ICTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F207ICTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207ICTX.build.board=GENERIC_F207ICTX
GenF2.menu.pnum.GENERIC_F207ICTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207ICTX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)

# Generic F207IETx
GenF2.menu.pnum.GENERIC_F207IETX=Generic F207IETx
GenF2.menu.pnum.GENERIC_F207IETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F207IETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IETX.build.board=GENERIC_F207IETX
GenF2.menu.pnum.GENERIC_F207IETX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IETX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)

# Generic F207IFTx
GenF2.menu.pnum.GENERIC_F207IFTX=Generic F207IFTx
GenF2.menu.pnum.GENERIC_F207IFTX.upload.maximum_size=786432
GenF2.menu.pnum.GENERIC_F207IFTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IFTX.build.board=GENERIC_F207IFTX
GenF2.menu.pnum.GENERIC_F207IFTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IFTX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)

# Generic F207IGTx
GenF2.menu.pnum.GENERIC_F207IGTX=Generic F207IGTx
GenF2.menu.pnum.GENERIC_F207IGTX.upload.maximum_size=1048576
GenF2.menu.pnum.GENERIC_F207IGTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207IGTX.build.board=GENERIC_F207IGTX
GenF2.menu.pnum.GENERIC_F207IGTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207IGTX.build.variant=STM32F2xx/F207I(C-E-F-G)(H-T)_F217I(E-G)(H-T)

# Generic F207VCTx
GenF2.menu.pnum.GENERIC_F207VCTX=Generic F207VCTx
GenF2.menu.pnum.GENERIC_F207VCTX.upload.maximum_size=262144
GenF2.menu.pnum.GENERIC_F207VCTX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207VCTX.build.board=GENERIC_F207VCTX
GenF2.menu.pnum.GENERIC_F207VCTX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207VCTX.build.variant=STM32F2xx/F207V(C-E-F-G)T_F217V(E-G)T

# Generic F207VETx
GenF2.menu.pnum.GENERIC_F207VETX=Generic F207VETx
GenF2.menu.pnum.GENERIC_F207VETX.upload.maximum_size=524288
GenF2.menu.pnum.GENERIC_F207VETX.upload.maximum_data_size=131072
GenF2.menu.pnum.GENERIC_F207VETX.build.board=GENERIC_F207VETX
GenF2.menu.pnum.GENERIC_F207VETX.build.product_line=STM32F207xx
GenF2.menu.pnum.GENERIC_F207VETX.build.variant=STM32F2xx/F207V(C-E-F-G)T_F217V(E-G)T

