stm32duino/Arduino_Core_STM32/boards.txt
# Generic F410RBTx
GenF4.menu.pnum.GENERIC_F410RBTX=Generic F410RBTx
GenF4.menu.pnum.GENERIC_F410RBTX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F410RBTX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410RBTX.build.board=GENERIC_F410RBTX
GenF4.menu.pnum.GENERIC_F410RBTX.build.product_line=STM32F410Rx
GenF4.menu.pnum.GENERIC_F410RBTX.build.variant=STM32F4xx/F410R(8-B)(I-T)

# Generic F410T8Yx
GenF4.menu.pnum.GENERIC_F410T8YX=Generic F410T8Yx
GenF4.menu.pnum.GENERIC_F410T8YX.upload.maximum_size=65536
GenF4.menu.pnum.GENERIC_F410T8YX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410T8YX.build.board=GENERIC_F410T8YX
GenF4.menu.pnum.GENERIC_F410T8YX.build.product_line=STM32F410Tx
GenF4.menu.pnum.GENERIC_F410T8YX.build.variant=STM32F4xx/F410T(8-B)Y

# Generic F410TBYx
GenF4.menu.pnum.GENERIC_F410TBYX=Generic F410TBYx
GenF4.menu.pnum.GENERIC_F410TBYX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F410TBYX.upload.maximum_data_size=32768
GenF4.menu.pnum.GENERIC_F410TBYX.build.board=GENERIC_F410TBYX
GenF4.menu.pnum.GENERIC_F410TBYX.build.product_line=STM32F410Tx
GenF4.menu.pnum.GENERIC_F410TBYX.build.variant=STM32F4xx/F410T(8-B)Y

# Generic F411CCUx
GenF4.menu.pnum.GENERIC_F411CCUX=Generic F411CCUx
GenF4.menu.pnum.GENERIC_F411CCUX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F411CCUX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411CCUX.build.board=GENERIC_F411CCUX
GenF4.menu.pnum.GENERIC_F411CCUX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411CCUX.build.variant=STM32F4xx/F411C(C-E)(U-Y)

# Generic F411CEUx
GenF4.menu.pnum.GENERIC_F411CEUX=Generic F411CEUx
GenF4.menu.pnum.GENERIC_F411CEUX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F411CEUX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411CEUX.build.board=GENERIC_F411CEUX
GenF4.menu.pnum.GENERIC_F411CEUX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411CEUX.build.variant=STM32F4xx/F411C(C-E)(U-Y)

# Generic F411CCYx
GenF4.menu.pnum.GENERIC_F411CCYX=Generic F411CCYx
GenF4.menu.pnum.GENERIC_F411CCYX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F411CCYX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411CCYX.build.board=GENERIC_F411CCYX
GenF4.menu.pnum.GENERIC_F411CCYX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411CCYX.build.variant=STM32F4xx/F411C(C-E)(U-Y)

# Generic F411CEYx
GenF4.menu.pnum.GENERIC_F411CEYX=Generic F411CEYx
GenF4.menu.pnum.GENERIC_F411CEYX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F411CEYX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411CEYX.build.board=GENERIC_F411CEYX
GenF4.menu.pnum.GENERIC_F411CEYX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411CEYX.build.variant=STM32F4xx/F411C(C-E)(U-Y)

# Generic F411RCTx
GenF4.menu.pnum.GENERIC_F411RCTX=Generic F411RCTx
GenF4.menu.pnum.GENERIC_F411RCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F411RCTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411RCTX.build.board=GENERIC_F411RCTX
GenF4.menu.pnum.GENERIC_F411RCTX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411RCTX.build.variant=STM32F4xx/F411R(C-E)T

# Generic F411RETx
GenF4.menu.pnum.GENERIC_F411RETX=Generic F411RETx
GenF4.menu.pnum.GENERIC_F411RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F411RETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F411RETX.build.board=GENERIC_F411RETX
GenF4.menu.pnum.GENERIC_F411RETX.build.product_line=STM32F411xE
GenF4.menu.pnum.GENERIC_F411RETX.build.variant=STM32F4xx/F411R(C-E)T

# Generic F412CEUx
GenF4.menu.pnum.GENERIC_F412CEUX=Generic F412CEUx
GenF4.menu.pnum.GENERIC_F412CEUX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412CEUX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412CEUX.build.board=GENERIC_F412CEUX
GenF4.menu.pnum.GENERIC_F412CEUX.build.product_line=STM32F412Cx
GenF4.menu.pnum.GENERIC_F412CEUX.build.variant=STM32F4xx/F412C(E-G)U

# Generic F412CGUx
GenF4.menu.pnum.GENERIC_F412CGUX=Generic F412CGUx
GenF4.menu.pnum.GENERIC_F412CGUX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412CGUX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412CGUX.build.board=GENERIC_F412CGUX
GenF4.menu.pnum.GENERIC_F412CGUX.build.product_line=STM32F412Cx
GenF4.menu.pnum.GENERIC_F412CGUX.build.variant=STM32F4xx/F412C(E-G)U

# Generic F412RETx
GenF4.menu.pnum.GENERIC_F412RETX=Generic F412RETx
GenF4.menu.pnum.GENERIC_F412RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412RETX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412RETX.build.board=GENERIC_F412RETX
GenF4.menu.pnum.GENERIC_F412RETX.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412RETX.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412RGTx
GenF4.menu.pnum.GENERIC_F412RGTX=Generic F412RGTx
GenF4.menu.pnum.GENERIC_F412RGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412RGTX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412RGTX.build.board=GENERIC_F412RGTX
GenF4.menu.pnum.GENERIC_F412RGTX.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412RGTX.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412REYx
GenF4.menu.pnum.GENERIC_F412REYX=Generic F412REYx
GenF4.menu.pnum.GENERIC_F412REYX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412REYX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412REYX.build.board=GENERIC_F412REYX
GenF4.menu.pnum.GENERIC_F412REYX.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412REYX.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412RGYx
GenF4.menu.pnum.GENERIC_F412RGYX=Generic F412RGYx
GenF4.menu.pnum.GENERIC_F412RGYX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412RGYX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412RGYX.build.board=GENERIC_F412RGYX
GenF4.menu.pnum.GENERIC_F412RGYX.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412RGYX.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412REYxP
GenF4.menu.pnum.GENERIC_F412REYXP=Generic F412REYxP
GenF4.menu.pnum.GENERIC_F412REYXP.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412REYXP.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412REYXP.build.board=GENERIC_F412REYXP
GenF4.menu.pnum.GENERIC_F412REYXP.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412REYXP.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412RGYxP
GenF4.menu.pnum.GENERIC_F412RGYXP=Generic F412RGYxP
GenF4.menu.pnum.GENERIC_F412RGYXP.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412RGYXP.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412RGYXP.build.board=GENERIC_F412RGYXP
GenF4.menu.pnum.GENERIC_F412RGYXP.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412RGYXP.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412ZEJx
GenF4.menu.pnum.GENERIC_F412ZEJX=Generic F412ZEJx
GenF4.menu.pnum.GENERIC_F412ZEJX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412ZEJX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412ZEJX.build.board=GENERIC_F412ZEJX
GenF4.menu.pnum.GENERIC_F412ZEJX.build.product_line=STM32F412Zx
GenF4.menu.pnum.GENERIC_F412ZEJX.build.variant=STM32F4xx/F412Z(E-G)(J-T)

# Generic F412ZGJx
GenF4.menu.pnum.GENERIC_F412ZGJX=Generic F412ZGJx
GenF4.menu.pnum.GENERIC_F412ZGJX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412ZGJX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412ZGJX.build.board=GENERIC_F412ZGJX
GenF4.menu.pnum.GENERIC_F412ZGJX.build.product_line=STM32F412Zx
GenF4.menu.pnum.GENERIC_F412ZGJX.build.variant=STM32F4xx/F412Z(E-G)(J-T)

# Generic F412ZETx
GenF4.menu.pnum.GENERIC_F412ZETX=Generic F412ZETx
GenF4.menu.pnum.GENERIC_F412ZETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412ZETX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412ZETX.build.board=GENERIC_F412ZETX
GenF4.menu.pnum.GENERIC_F412ZETX.build.product_line=STM32F412Zx
GenF4.menu.pnum.GENERIC_F412ZETX.build.variant=STM32F4xx/F412Z(E-G)(J-T)

