stm32duino/Arduino_Core_STM32/boards.txt
# Generic F412ZGTx
GenF4.menu.pnum.GENERIC_F412ZGTX=Generic F412ZGTx
GenF4.menu.pnum.GENERIC_F412ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412ZGTX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412ZGTX.build.board=GENERIC_F412ZGTX
GenF4.menu.pnum.GENERIC_F412ZGTX.build.product_line=STM32F412Zx
GenF4.menu.pnum.GENERIC_F412ZGTX.build.variant=STM32F4xx/F412Z(E-G)(J-T)

# Generic F413CGUx
GenF4.menu.pnum.GENERIC_F413CGUX=Generic F413CGUx
GenF4.menu.pnum.GENERIC_F413CGUX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F413CGUX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413CGUX.build.board=GENERIC_F413CGUX
GenF4.menu.pnum.GENERIC_F413CGUX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413CGUX.build.variant=STM32F4xx/F413C(G-H)U_F423CHU

# Generic F413CHUx
GenF4.menu.pnum.GENERIC_F413CHUX=Generic F413CHUx
GenF4.menu.pnum.GENERIC_F413CHUX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F413CHUX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413CHUX.build.board=GENERIC_F413CHUX
GenF4.menu.pnum.GENERIC_F413CHUX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413CHUX.build.variant=STM32F4xx/F413C(G-H)U_F423CHU

# Generic F413RGTx
GenF4.menu.pnum.GENERIC_F413RGTX=Generic F413RGTx
GenF4.menu.pnum.GENERIC_F413RGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F413RGTX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413RGTX.build.board=GENERIC_F413RGTX
GenF4.menu.pnum.GENERIC_F413RGTX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413RGTX.build.variant=STM32F4xx/F413R(G-H)T_F423RHT

# Generic F413RHTx
GenF4.menu.pnum.GENERIC_F413RHTX=Generic F413RHTx
GenF4.menu.pnum.GENERIC_F413RHTX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F413RHTX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413RHTX.build.board=GENERIC_F413RHTX
GenF4.menu.pnum.GENERIC_F413RHTX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413RHTX.build.variant=STM32F4xx/F413R(G-H)T_F423RHT

# Generic F413ZGJx
GenF4.menu.pnum.GENERIC_F413ZGJX=Generic F413ZGJx
GenF4.menu.pnum.GENERIC_F413ZGJX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F413ZGJX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413ZGJX.build.board=GENERIC_F413ZGJX
GenF4.menu.pnum.GENERIC_F413ZGJX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413ZGJX.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)

# Generic F413ZHJx
GenF4.menu.pnum.GENERIC_F413ZHJX=Generic F413ZHJx
GenF4.menu.pnum.GENERIC_F413ZHJX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F413ZHJX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413ZHJX.build.board=GENERIC_F413ZHJX
GenF4.menu.pnum.GENERIC_F413ZHJX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413ZHJX.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)

# Generic F413ZGTx
GenF4.menu.pnum.GENERIC_F413ZGTX=Generic F413ZGTx
GenF4.menu.pnum.GENERIC_F413ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F413ZGTX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413ZGTX.build.board=GENERIC_F413ZGTX
GenF4.menu.pnum.GENERIC_F413ZGTX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413ZGTX.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)

# Generic F413ZHTx
GenF4.menu.pnum.GENERIC_F413ZHTX=Generic F413ZHTx
GenF4.menu.pnum.GENERIC_F413ZHTX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F413ZHTX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413ZHTX.build.board=GENERIC_F413ZHTX
GenF4.menu.pnum.GENERIC_F413ZHTX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413ZHTX.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)

# Generic F415RGTx
GenF4.menu.pnum.GENERIC_F415RGTX=Generic F415RGTx
GenF4.menu.pnum.GENERIC_F415RGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F415RGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F415RGTX.build.board=GENERIC_F415RGTX
GenF4.menu.pnum.GENERIC_F415RGTX.build.product_line=STM32F415xx
GenF4.menu.pnum.GENERIC_F415RGTX.build.variant=STM32F4xx/F405RGT_F415RGT

# Generic F417VETx
GenF4.menu.pnum.GENERIC_F417VETX=Generic F417VETx
GenF4.menu.pnum.GENERIC_F417VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F417VETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F417VETX.build.board=GENERIC_F417VETX
GenF4.menu.pnum.GENERIC_F417VETX.build.product_line=STM32F417xx
GenF4.menu.pnum.GENERIC_F417VETX.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T

# Generic F417VGTx
GenF4.menu.pnum.GENERIC_F417VGTX=Generic F417VGTx
GenF4.menu.pnum.GENERIC_F417VGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F417VGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F417VGTX.build.board=GENERIC_F417VGTX
GenF4.menu.pnum.GENERIC_F417VGTX.build.product_line=STM32F417xx
GenF4.menu.pnum.GENERIC_F417VGTX.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T

# Generic F417ZETx
GenF4.menu.pnum.GENERIC_F417ZETX=Generic F417ZETx
GenF4.menu.pnum.GENERIC_F417ZETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F417ZETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F417ZETX.build.board=GENERIC_F417ZETX
GenF4.menu.pnum.GENERIC_F417ZETX.build.product_line=STM32F417xx
GenF4.menu.pnum.GENERIC_F417ZETX.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T

# Generic F417ZGTx
GenF4.menu.pnum.GENERIC_F417ZGTX=Generic F417ZGTx
GenF4.menu.pnum.GENERIC_F417ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F417ZGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F417ZGTX.build.board=GENERIC_F417ZGTX
GenF4.menu.pnum.GENERIC_F417ZGTX.build.product_line=STM32F417xx
GenF4.menu.pnum.GENERIC_F417ZGTX.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T

# Generic F423CHUx
GenF4.menu.pnum.GENERIC_F423CHUX=Generic F423CHUx
GenF4.menu.pnum.GENERIC_F423CHUX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F423CHUX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F423CHUX.build.board=GENERIC_F423CHUX
GenF4.menu.pnum.GENERIC_F423CHUX.build.product_line=STM32F423xx
GenF4.menu.pnum.GENERIC_F423CHUX.build.variant=STM32F4xx/F413C(G-H)U_F423CHU

