stm32duino/Arduino_Core_STM32/boards.txt
# Generic F446RCTx
GenF4.menu.pnum.GENERIC_F446RCTX=Generic F446RCTx
GenF4.menu.pnum.GENERIC_F446RCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446RCTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446RCTX.build.board=GENERIC_F446RCTX
GenF4.menu.pnum.GENERIC_F446RCTX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446RCTX.build.variant=STM32F4xx/F446R(C-E)T

# Generic F446RETx
GenF4.menu.pnum.GENERIC_F446RETX=Generic F446RETx
GenF4.menu.pnum.GENERIC_F446RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446RETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446RETX.build.board=GENERIC_F446RETX
GenF4.menu.pnum.GENERIC_F446RETX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446RETX.build.variant=STM32F4xx/F446R(C-E)T

# Generic F446VCTx
GenF4.menu.pnum.GENERIC_F446VCTX=Generic F446VCTx
GenF4.menu.pnum.GENERIC_F446VCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446VCTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446VCTX.build.board=GENERIC_F446VCTX
GenF4.menu.pnum.GENERIC_F446VCTX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446VCTX.build.variant=STM32F4xx/F446V(C-E)T

# Generic F446VETx
GenF4.menu.pnum.GENERIC_F446VETX=Generic F446VETx
GenF4.menu.pnum.GENERIC_F446VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446VETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446VETX.build.board=GENERIC_F446VETX
GenF4.menu.pnum.GENERIC_F446VETX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446VETX.build.variant=STM32F4xx/F446V(C-E)T

# Generic F446ZCHx
GenF4.menu.pnum.GENERIC_F446ZCHX=Generic F446ZCHx
GenF4.menu.pnum.GENERIC_F446ZCHX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446ZCHX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZCHX.build.board=GENERIC_F446ZCHX
GenF4.menu.pnum.GENERIC_F446ZCHX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZCHX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Generic F446ZCJx
GenF4.menu.pnum.GENERIC_F446ZCJX=Generic F446ZCJx
GenF4.menu.pnum.GENERIC_F446ZCJX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446ZCJX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZCJX.build.board=GENERIC_F446ZCJX
GenF4.menu.pnum.GENERIC_F446ZCJX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZCJX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Generic F446ZCTx
GenF4.menu.pnum.GENERIC_F446ZCTX=Generic F446ZCTx
GenF4.menu.pnum.GENERIC_F446ZCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446ZCTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZCTX.build.board=GENERIC_F446ZCTX
GenF4.menu.pnum.GENERIC_F446ZCTX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZCTX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Generic F446ZEHx
GenF4.menu.pnum.GENERIC_F446ZEHX=Generic F446ZEHx
GenF4.menu.pnum.GENERIC_F446ZEHX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446ZEHX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZEHX.build.board=GENERIC_F446ZEHX
GenF4.menu.pnum.GENERIC_F446ZEHX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZEHX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Generic F446ZEJx
GenF4.menu.pnum.GENERIC_F446ZEJX=Generic F446ZEJx
GenF4.menu.pnum.GENERIC_F446ZEJX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446ZEJX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZEJX.build.board=GENERIC_F446ZEJX
GenF4.menu.pnum.GENERIC_F446ZEJX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZEJX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Generic F446ZETx
GenF4.menu.pnum.GENERIC_F446ZETX=Generic F446ZETx
GenF4.menu.pnum.GENERIC_F446ZETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446ZETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZETX.build.board=GENERIC_F446ZETX
GenF4.menu.pnum.GENERIC_F446ZETX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZETX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Upload menu
GenF4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF4.menu.upload_method.swdMethod.upload.protocol=0
GenF4.menu.upload_method.swdMethod.upload.options=
GenF4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF4.menu.upload_method.serialMethod.upload.protocol=1
GenF4.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF4.menu.upload_method.dfuMethod.upload.protocol=2
GenF4.menu.upload_method.dfuMethod.upload.options=
GenF4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID

################################################################################
# Generic F7

GenF7.name=Generic STM32F7 series

GenF7.build.core=arduino
GenF7.build.board=GenF7
GenF7.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF7.build.mcu=cortex-m7
GenF7.build.fpu=-mfpu=fpv4-sp-d16
GenF7.build.float-abi=-mfloat-abi=hard
GenF7.build.series=STM32F7xx
GenF7.build.flash_offset=0x0
GenF7.upload.maximum_size=0
GenF7.upload.maximum_data_size=0

# Generic F722RCTx
GenF7.menu.pnum.GENERIC_F722RCTX=Generic F722RCTx
GenF7.menu.pnum.GENERIC_F722RCTX.upload.maximum_size=262144
GenF7.menu.pnum.GENERIC_F722RCTX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F722RCTX.build.board=GENERIC_F722RCTX
GenF7.menu.pnum.GENERIC_F722RCTX.build.product_line=STM32F722xx
GenF7.menu.pnum.GENERIC_F722RCTX.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET

# Generic F722RETx
GenF7.menu.pnum.GENERIC_F722RETX=Generic F722RETx
GenF7.menu.pnum.GENERIC_F722RETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F722RETX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F722RETX.build.board=GENERIC_F722RETX
GenF7.menu.pnum.GENERIC_F722RETX.build.product_line=STM32F722xx
GenF7.menu.pnum.GENERIC_F722RETX.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET

# Generic F722ZCTx
GenF7.menu.pnum.GENERIC_F722ZCTX=Generic F722ZCTx
GenF7.menu.pnum.GENERIC_F722ZCTX.upload.maximum_size=262144
GenF7.menu.pnum.GENERIC_F722ZCTX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F722ZCTX.build.board=GENERIC_F722ZCTX
GenF7.menu.pnum.GENERIC_F722ZCTX.build.product_line=STM32F722xx
GenF7.menu.pnum.GENERIC_F722ZCTX.build.variant=STM32F7xx/F722Z(C-E)T_F732ZET

# Generic F722ZETx
GenF7.menu.pnum.GENERIC_F722ZETX=Generic F722ZETx
GenF7.menu.pnum.GENERIC_F722ZETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F722ZETX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F722ZETX.build.board=GENERIC_F722ZETX
GenF7.menu.pnum.GENERIC_F722ZETX.build.product_line=STM32F722xx
GenF7.menu.pnum.GENERIC_F722ZETX.build.variant=STM32F7xx/F722Z(C-E)T_F732ZET

