stm32duino/Arduino_Core_STM32/boards.txt
# Generic G0C1NEYx
GenG0.menu.pnum.GENERIC_G0C1NEYX=Generic G0C1NEYx
GenG0.menu.pnum.GENERIC_G0C1NEYX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1NEYX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1NEYX.build.board=GENERIC_G0C1NEYX
GenG0.menu.pnum.GENERIC_G0C1NEYX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1NEYX.build.variant=STM32G0xx/G0B1NEY_G0C1NEY

# Generic G0B1RBTx
GenG0.menu.pnum.GENERIC_G0B1RBTX=Generic G0B1RBTx
GenG0.menu.pnum.GENERIC_G0B1RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1RBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1RBTX.build.board=GENERIC_G0B1RBTX
GenG0.menu.pnum.GENERIC_G0B1RBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1RBTX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T

# Generic G0B1RCTx
GenG0.menu.pnum.GENERIC_G0B1RCTX=Generic G0B1RCTx
GenG0.menu.pnum.GENERIC_G0B1RCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1RCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1RCTX.build.board=GENERIC_G0B1RCTX
GenG0.menu.pnum.GENERIC_G0B1RCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1RCTX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T

# Generic G0B1RETx
GenG0.menu.pnum.GENERIC_G0B1RETX=Generic G0B1RETx
GenG0.menu.pnum.GENERIC_G0B1RETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1RETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1RETX.build.board=GENERIC_G0B1RETX
GenG0.menu.pnum.GENERIC_G0B1RETX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1RETX.build.variant=STM32G0xx/G0B1R(B-C-E)T_G0C1R(C-E)T

# Generic G0B1VBIx
GenG0.menu.pnum.GENERIC_G0B1VBIX=Generic G0B1VBIx
GenG0.menu.pnum.GENERIC_G0B1VBIX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1VBIX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VBIX.build.board=GENERIC_G0B1VBIX
GenG0.menu.pnum.GENERIC_G0B1VBIX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VBIX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)

# Generic G0B1VCIx
GenG0.menu.pnum.GENERIC_G0B1VCIX=Generic G0B1VCIx
GenG0.menu.pnum.GENERIC_G0B1VCIX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1VCIX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VCIX.build.board=GENERIC_G0B1VCIX
GenG0.menu.pnum.GENERIC_G0B1VCIX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VCIX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)

# Generic G0B1VEIx
GenG0.menu.pnum.GENERIC_G0B1VEIX=Generic G0B1VEIx
GenG0.menu.pnum.GENERIC_G0B1VEIX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1VEIX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VEIX.build.board=GENERIC_G0B1VEIX
GenG0.menu.pnum.GENERIC_G0B1VEIX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VEIX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)

# Generic G0B1VBTx
GenG0.menu.pnum.GENERIC_G0B1VBTX=Generic G0B1VBTx
GenG0.menu.pnum.GENERIC_G0B1VBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G0B1VBTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VBTX.build.board=GENERIC_G0B1VBTX
GenG0.menu.pnum.GENERIC_G0B1VBTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VBTX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)

# Generic G0B1VCTx
GenG0.menu.pnum.GENERIC_G0B1VCTX=Generic G0B1VCTx
GenG0.menu.pnum.GENERIC_G0B1VCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0B1VCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VCTX.build.board=GENERIC_G0B1VCTX
GenG0.menu.pnum.GENERIC_G0B1VCTX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VCTX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)

# Generic G0B1VETx
GenG0.menu.pnum.GENERIC_G0B1VETX=Generic G0B1VETx
GenG0.menu.pnum.GENERIC_G0B1VETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0B1VETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0B1VETX.build.board=GENERIC_G0B1VETX
GenG0.menu.pnum.GENERIC_G0B1VETX.build.product_line=STM32G0B1xx
GenG0.menu.pnum.GENERIC_G0B1VETX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)

# Generic G0C1VCIx
GenG0.menu.pnum.GENERIC_G0C1VCIX=Generic G0C1VCIx
GenG0.menu.pnum.GENERIC_G0C1VCIX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1VCIX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1VCIX.build.board=GENERIC_G0C1VCIX
GenG0.menu.pnum.GENERIC_G0C1VCIX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1VCIX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)

# Generic G0C1VEIx
GenG0.menu.pnum.GENERIC_G0C1VEIX=Generic G0C1VEIx
GenG0.menu.pnum.GENERIC_G0C1VEIX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1VEIX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1VEIX.build.board=GENERIC_G0C1VEIX
GenG0.menu.pnum.GENERIC_G0C1VEIX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1VEIX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)

# Generic G0C1VCTx
GenG0.menu.pnum.GENERIC_G0C1VCTX=Generic G0C1VCTx
GenG0.menu.pnum.GENERIC_G0C1VCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1VCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1VCTX.build.board=GENERIC_G0C1VCTX
GenG0.menu.pnum.GENERIC_G0C1VCTX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1VCTX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)

# Generic G0C1VETx
GenG0.menu.pnum.GENERIC_G0C1VETX=Generic G0C1VETx
GenG0.menu.pnum.GENERIC_G0C1VETX.upload.maximum_size=524288
GenG0.menu.pnum.GENERIC_G0C1VETX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1VETX.build.board=GENERIC_G0C1VETX
GenG0.menu.pnum.GENERIC_G0C1VETX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1VETX.build.variant=STM32G0xx/G0B1V(B-C-E)(I-T)_G0C1V(C-E)(I-T)

# Generic G0C1CCTx
GenG0.menu.pnum.GENERIC_G0C1CCTX=Generic G0C1CCTx
GenG0.menu.pnum.GENERIC_G0C1CCTX.upload.maximum_size=262144
GenG0.menu.pnum.GENERIC_G0C1CCTX.upload.maximum_data_size=147456
GenG0.menu.pnum.GENERIC_G0C1CCTX.build.board=GENERIC_G0C1CCTX
GenG0.menu.pnum.GENERIC_G0C1CCTX.build.product_line=STM32G0C1xx
GenG0.menu.pnum.GENERIC_G0C1CCTX.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)

