stm32duino/Arduino_Core_STM32/boards.txt
# Generic G431KBTx
GenG4.menu.pnum.GENERIC_G431KBTX=Generic G431KBTx
GenG4.menu.pnum.GENERIC_G431KBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431KBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431KBTX.build.board=GENERIC_G431KBTX
GenG4.menu.pnum.GENERIC_G431KBTX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431KBTX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431K6Ux
GenG4.menu.pnum.GENERIC_G431K6UX=Generic G431K6Ux
GenG4.menu.pnum.GENERIC_G431K6UX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431K6UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431K6UX.build.board=GENERIC_G431K6UX
GenG4.menu.pnum.GENERIC_G431K6UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431K6UX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431K8Ux
GenG4.menu.pnum.GENERIC_G431K8UX=Generic G431K8Ux
GenG4.menu.pnum.GENERIC_G431K8UX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431K8UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431K8UX.build.board=GENERIC_G431K8UX
GenG4.menu.pnum.GENERIC_G431K8UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431K8UX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431KBUx
GenG4.menu.pnum.GENERIC_G431KBUX=Generic G431KBUx
GenG4.menu.pnum.GENERIC_G431KBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431KBUX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431KBUX.build.board=GENERIC_G431KBUX
GenG4.menu.pnum.GENERIC_G431KBUX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431KBUX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431M6Tx
GenG4.menu.pnum.GENERIC_G431M6TX=Generic G431M6Tx
GenG4.menu.pnum.GENERIC_G431M6TX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431M6TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431M6TX.build.board=GENERIC_G431M6TX
GenG4.menu.pnum.GENERIC_G431M6TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431M6TX.build.variant=STM32G4xx/G431M(6-8-B)T_G441MBT

# Generic G431M8Tx
GenG4.menu.pnum.GENERIC_G431M8TX=Generic G431M8Tx
GenG4.menu.pnum.GENERIC_G431M8TX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431M8TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431M8TX.build.board=GENERIC_G431M8TX
GenG4.menu.pnum.GENERIC_G431M8TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431M8TX.build.variant=STM32G4xx/G431M(6-8-B)T_G441MBT

# Generic G431MBTx
GenG4.menu.pnum.GENERIC_G431MBTX=Generic G431MBTx
GenG4.menu.pnum.GENERIC_G431MBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431MBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431MBTX.build.board=GENERIC_G431MBTX
GenG4.menu.pnum.GENERIC_G431MBTX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431MBTX.build.variant=STM32G4xx/G431M(6-8-B)T_G441MBT

# Generic G431R6Ix
GenG4.menu.pnum.GENERIC_G431R6IX=Generic G431R6Ix
GenG4.menu.pnum.GENERIC_G431R6IX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431R6IX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431R6IX.build.board=GENERIC_G431R6IX
GenG4.menu.pnum.GENERIC_G431R6IX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431R6IX.build.variant=STM32G4xx/G431R(6-8-B)(I-T)_G441RB(I-T)

# Generic G431R8Ix
GenG4.menu.pnum.GENERIC_G431R8IX=Generic G431R8Ix
GenG4.menu.pnum.GENERIC_G431R8IX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431R8IX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431R8IX.build.board=GENERIC_G431R8IX
GenG4.menu.pnum.GENERIC_G431R8IX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431R8IX.build.variant=STM32G4xx/G431R(6-8-B)(I-T)_G441RB(I-T)

# Generic G431RBIx
GenG4.menu.pnum.GENERIC_G431RBIX=Generic G431RBIx
GenG4.menu.pnum.GENERIC_G431RBIX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431RBIX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431RBIX.build.board=GENERIC_G431RBIX
GenG4.menu.pnum.GENERIC_G431RBIX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431RBIX.build.variant=STM32G4xx/G431R(6-8-B)(I-T)_G441RB(I-T)

# Generic G431R6Tx
GenG4.menu.pnum.GENERIC_G431R6TX=Generic G431R6Tx
GenG4.menu.pnum.GENERIC_G431R6TX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431R6TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431R6TX.build.board=GENERIC_G431R6TX
GenG4.menu.pnum.GENERIC_G431R6TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431R6TX.build.variant=STM32G4xx/G431R(6-8-B)(I-T)_G441RB(I-T)

# Generic G431R8Tx
GenG4.menu.pnum.GENERIC_G431R8TX=Generic G431R8Tx
GenG4.menu.pnum.GENERIC_G431R8TX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431R8TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431R8TX.build.board=GENERIC_G431R8TX
GenG4.menu.pnum.GENERIC_G431R8TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431R8TX.build.variant=STM32G4xx/G431R(6-8-B)(I-T)_G441RB(I-T)

# Generic G431RBTx
GenG4.menu.pnum.GENERIC_G431RBTX=Generic G431RBTx
GenG4.menu.pnum.GENERIC_G431RBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431RBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431RBTX.build.board=GENERIC_G431RBTX
GenG4.menu.pnum.GENERIC_G431RBTX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431RBTX.build.variant=STM32G4xx/G431R(6-8-B)(I-T)_G441RB(I-T)

# Generic G431V6Tx
GenG4.menu.pnum.GENERIC_G431V6TX=Generic G431V6Tx
GenG4.menu.pnum.GENERIC_G431V6TX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431V6TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431V6TX.build.board=GENERIC_G431V6TX
GenG4.menu.pnum.GENERIC_G431V6TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431V6TX.build.variant=STM32G4xx/G431V(6-8-B)T_G441VBT

# Generic G431V8Tx
GenG4.menu.pnum.GENERIC_G431V8TX=Generic G431V8Tx
GenG4.menu.pnum.GENERIC_G431V8TX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431V8TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431V8TX.build.board=GENERIC_G431V8TX
GenG4.menu.pnum.GENERIC_G431V8TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431V8TX.build.variant=STM32G4xx/G431V(6-8-B)T_G441VBT

# Generic G431VBTx
GenG4.menu.pnum.GENERIC_G431VBTX=Generic G431VBTx
GenG4.menu.pnum.GENERIC_G431VBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431VBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431VBTX.build.board=GENERIC_G431VBTX
GenG4.menu.pnum.GENERIC_G431VBTX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431VBTX.build.variant=STM32G4xx/G431V(6-8-B)T_G441VBT

# Generic G441CBTx
GenG4.menu.pnum.GENERIC_G441CBTX=Generic G441CBTx
GenG4.menu.pnum.GENERIC_G441CBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441CBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441CBTX.build.board=GENERIC_G441CBTX
GenG4.menu.pnum.GENERIC_G441CBTX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441CBTX.build.variant=STM32G4xx/G431C(6-8-B)T_G441CBT

# Generic G441CBUx
GenG4.menu.pnum.GENERIC_G441CBUX=Generic G441CBUx
GenG4.menu.pnum.GENERIC_G441CBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441CBUX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441CBUX.build.board=GENERIC_G441CBUX
GenG4.menu.pnum.GENERIC_G441CBUX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441CBUX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU

