stm32duino/Arduino_Core_STM32/boards.txt
# Generic G473VEHx
GenG4.menu.pnum.GENERIC_G473VEHX=Generic G473VEHx
GenG4.menu.pnum.GENERIC_G473VEHX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473VEHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473VEHX.build.board=GENERIC_G473VEHX
GenG4.menu.pnum.GENERIC_G473VEHX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473VEHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G473VBTx
GenG4.menu.pnum.GENERIC_G473VBTX=Generic G473VBTx
GenG4.menu.pnum.GENERIC_G473VBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473VBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473VBTX.build.board=GENERIC_G473VBTX
GenG4.menu.pnum.GENERIC_G473VBTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473VBTX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G473VCTx
GenG4.menu.pnum.GENERIC_G473VCTX=Generic G473VCTx
GenG4.menu.pnum.GENERIC_G473VCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473VCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473VCTX.build.board=GENERIC_G473VCTX
GenG4.menu.pnum.GENERIC_G473VCTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473VCTX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G473VETx
GenG4.menu.pnum.GENERIC_G473VETX=Generic G473VETx
GenG4.menu.pnum.GENERIC_G473VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473VETX.build.board=GENERIC_G473VETX
GenG4.menu.pnum.GENERIC_G473VETX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473VETX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G474CBTx
GenG4.menu.pnum.GENERIC_G474CBTX=Generic G474CBTx
GenG4.menu.pnum.GENERIC_G474CBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474CBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474CBTX.build.board=GENERIC_G474CBTX
GenG4.menu.pnum.GENERIC_G474CBTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474CBTX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET

# Generic G474CCTx
GenG4.menu.pnum.GENERIC_G474CCTX=Generic G474CCTx
GenG4.menu.pnum.GENERIC_G474CCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474CCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474CCTX.build.board=GENERIC_G474CCTX
GenG4.menu.pnum.GENERIC_G474CCTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474CCTX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET

# Generic G474CETx
GenG4.menu.pnum.GENERIC_G474CETX=Generic G474CETx
GenG4.menu.pnum.GENERIC_G474CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474CETX.build.board=GENERIC_G474CETX
GenG4.menu.pnum.GENERIC_G474CETX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474CETX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET

# Generic G474MBTx
GenG4.menu.pnum.GENERIC_G474MBTX=Generic G474MBTx
GenG4.menu.pnum.GENERIC_G474MBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474MBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474MBTX.build.board=GENERIC_G474MBTX
GenG4.menu.pnum.GENERIC_G474MBTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474MBTX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET

# Generic G474MCTx
GenG4.menu.pnum.GENERIC_G474MCTX=Generic G474MCTx
GenG4.menu.pnum.GENERIC_G474MCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474MCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474MCTX.build.board=GENERIC_G474MCTX
GenG4.menu.pnum.GENERIC_G474MCTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474MCTX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET

# Generic G474METx
GenG4.menu.pnum.GENERIC_G474METX=Generic G474METx
GenG4.menu.pnum.GENERIC_G474METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474METX.build.board=GENERIC_G474METX
GenG4.menu.pnum.GENERIC_G474METX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474METX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET

# Generic G474PBIx
GenG4.menu.pnum.GENERIC_G474PBIX=Generic G474PBIx
GenG4.menu.pnum.GENERIC_G474PBIX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474PBIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474PBIX.build.board=GENERIC_G474PBIX
GenG4.menu.pnum.GENERIC_G474PBIX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474PBIX.build.variant=STM32G4xx/G473P(B-C-E)I_G474P(B-C-E)I_G483PEI_G484PEI

# Generic G474PCIx
GenG4.menu.pnum.GENERIC_G474PCIX=Generic G474PCIx
GenG4.menu.pnum.GENERIC_G474PCIX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474PCIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474PCIX.build.board=GENERIC_G474PCIX
GenG4.menu.pnum.GENERIC_G474PCIX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474PCIX.build.variant=STM32G4xx/G473P(B-C-E)I_G474P(B-C-E)I_G483PEI_G484PEI

# Generic G474PEIx
GenG4.menu.pnum.GENERIC_G474PEIX=Generic G474PEIx
GenG4.menu.pnum.GENERIC_G474PEIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474PEIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474PEIX.build.board=GENERIC_G474PEIX
GenG4.menu.pnum.GENERIC_G474PEIX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474PEIX.build.variant=STM32G4xx/G473P(B-C-E)I_G474P(B-C-E)I_G483PEI_G484PEI

# Generic G474RBTx
GenG4.menu.pnum.GENERIC_G474RBTX=Generic G474RBTx
GenG4.menu.pnum.GENERIC_G474RBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474RBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474RBTX.build.board=GENERIC_G474RBTX
GenG4.menu.pnum.GENERIC_G474RBTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474RBTX.build.variant=STM32G4xx/G473R(B-C-E)T_G474R(B-C-E)T_G483RET_G484RET

# Generic G474RCTx
GenG4.menu.pnum.GENERIC_G474RCTX=Generic G474RCTx
GenG4.menu.pnum.GENERIC_G474RCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474RCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474RCTX.build.board=GENERIC_G474RCTX
GenG4.menu.pnum.GENERIC_G474RCTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474RCTX.build.variant=STM32G4xx/G473R(B-C-E)T_G474R(B-C-E)T_G483RET_G484RET

# Generic G474RETx
GenG4.menu.pnum.GENERIC_G474RETX=Generic G474RETx
GenG4.menu.pnum.GENERIC_G474RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474RETX.build.board=GENERIC_G474RETX
GenG4.menu.pnum.GENERIC_G474RETX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474RETX.build.variant=STM32G4xx/G473R(B-C-E)T_G474R(B-C-E)T_G483RET_G484RET

# Generic G474QBTx
GenG4.menu.pnum.GENERIC_G474QBTX=Generic G474QBTx
GenG4.menu.pnum.GENERIC_G474QBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474QBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474QBTX.build.board=GENERIC_G474QBTX
GenG4.menu.pnum.GENERIC_G474QBTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474QBTX.build.variant=STM32G4xx/G473Q(B-C-E)T_G474Q(B-C-E)T_G483QET_G484QET

# Generic G474QCTx
GenG4.menu.pnum.GENERIC_G474QCTX=Generic G474QCTx
GenG4.menu.pnum.GENERIC_G474QCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474QCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474QCTX.build.board=GENERIC_G474QCTX
GenG4.menu.pnum.GENERIC_G474QCTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474QCTX.build.variant=STM32G4xx/G473Q(B-C-E)T_G474Q(B-C-E)T_G483QET_G484QET

