stm32duino/Arduino_Core_STM32/boards.txt
# Generic G474QETx
GenG4.menu.pnum.GENERIC_G474QETX=Generic G474QETx
GenG4.menu.pnum.GENERIC_G474QETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474QETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474QETX.build.board=GENERIC_G474QETX
GenG4.menu.pnum.GENERIC_G474QETX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474QETX.build.variant=STM32G4xx/G473Q(B-C-E)T_G474Q(B-C-E)T_G483QET_G484QET

# Generic G474VBHx
GenG4.menu.pnum.GENERIC_G474VBHX=Generic G474VBHx
GenG4.menu.pnum.GENERIC_G474VBHX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474VBHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VBHX.build.board=GENERIC_G474VBHX
GenG4.menu.pnum.GENERIC_G474VBHX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VBHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G474VCHx
GenG4.menu.pnum.GENERIC_G474VCHX=Generic G474VCHx
GenG4.menu.pnum.GENERIC_G474VCHX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474VCHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VCHX.build.board=GENERIC_G474VCHX
GenG4.menu.pnum.GENERIC_G474VCHX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VCHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G474VEHx
GenG4.menu.pnum.GENERIC_G474VEHX=Generic G474VEHx
GenG4.menu.pnum.GENERIC_G474VEHX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474VEHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VEHX.build.board=GENERIC_G474VEHX
GenG4.menu.pnum.GENERIC_G474VEHX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VEHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G474VBTx
GenG4.menu.pnum.GENERIC_G474VBTX=Generic G474VBTx
GenG4.menu.pnum.GENERIC_G474VBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G474VBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VBTX.build.board=GENERIC_G474VBTX
GenG4.menu.pnum.GENERIC_G474VBTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VBTX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G474VCTx
GenG4.menu.pnum.GENERIC_G474VCTX=Generic G474VCTx
GenG4.menu.pnum.GENERIC_G474VCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G474VCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VCTX.build.board=GENERIC_G474VCTX
GenG4.menu.pnum.GENERIC_G474VCTX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VCTX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G474VETx
GenG4.menu.pnum.GENERIC_G474VETX=Generic G474VETx
GenG4.menu.pnum.GENERIC_G474VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474VETX.build.board=GENERIC_G474VETX
GenG4.menu.pnum.GENERIC_G474VETX.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474VETX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G483CETx
GenG4.menu.pnum.GENERIC_G483CETX=Generic G483CETx
GenG4.menu.pnum.GENERIC_G483CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G483CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G483CETX.build.board=GENERIC_G483CETX
GenG4.menu.pnum.GENERIC_G483CETX.build.product_line=STM32G483xx
GenG4.menu.pnum.GENERIC_G483CETX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET

# Generic G483METx
GenG4.menu.pnum.GENERIC_G483METX=Generic G483METx
GenG4.menu.pnum.GENERIC_G483METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G483METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G483METX.build.board=GENERIC_G483METX
GenG4.menu.pnum.GENERIC_G483METX.build.product_line=STM32G483xx
GenG4.menu.pnum.GENERIC_G483METX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET

# Generic G483PEIx
GenG4.menu.pnum.GENERIC_G483PEIX=Generic G483PEIx
GenG4.menu.pnum.GENERIC_G483PEIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G483PEIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G483PEIX.build.board=GENERIC_G483PEIX
GenG4.menu.pnum.GENERIC_G483PEIX.build.product_line=STM32G483xx
GenG4.menu.pnum.GENERIC_G483PEIX.build.variant=STM32G4xx/G473P(B-C-E)I_G474P(B-C-E)I_G483PEI_G484PEI

# Generic G483RETx
GenG4.menu.pnum.GENERIC_G483RETX=Generic G483RETx
GenG4.menu.pnum.GENERIC_G483RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G483RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G483RETX.build.board=GENERIC_G483RETX
GenG4.menu.pnum.GENERIC_G483RETX.build.product_line=STM32G483xx
GenG4.menu.pnum.GENERIC_G483RETX.build.variant=STM32G4xx/G473R(B-C-E)T_G474R(B-C-E)T_G483RET_G484RET

# Generic G483QETx
GenG4.menu.pnum.GENERIC_G483QETX=Generic G483QETx
GenG4.menu.pnum.GENERIC_G483QETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G483QETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G483QETX.build.board=GENERIC_G483QETX
GenG4.menu.pnum.GENERIC_G483QETX.build.product_line=STM32G483xx
GenG4.menu.pnum.GENERIC_G483QETX.build.variant=STM32G4xx/G473Q(B-C-E)T_G474Q(B-C-E)T_G483QET_G484QET

# Generic G483VEHx
GenG4.menu.pnum.GENERIC_G483VEHX=Generic G483VEHx
GenG4.menu.pnum.GENERIC_G483VEHX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G483VEHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G483VEHX.build.board=GENERIC_G483VEHX
GenG4.menu.pnum.GENERIC_G483VEHX.build.product_line=STM32G483xx
GenG4.menu.pnum.GENERIC_G483VEHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G483VETx
GenG4.menu.pnum.GENERIC_G483VETX=Generic G483VETx
GenG4.menu.pnum.GENERIC_G483VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G483VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G483VETX.build.board=GENERIC_G483VETX
GenG4.menu.pnum.GENERIC_G483VETX.build.product_line=STM32G483xx
GenG4.menu.pnum.GENERIC_G483VETX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G484CETx
GenG4.menu.pnum.GENERIC_G484CETX=Generic G484CETx
GenG4.menu.pnum.GENERIC_G484CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484CETX.build.board=GENERIC_G484CETX
GenG4.menu.pnum.GENERIC_G484CETX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484CETX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET

# Generic G484METx
GenG4.menu.pnum.GENERIC_G484METX=Generic G484METx
GenG4.menu.pnum.GENERIC_G484METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484METX.build.board=GENERIC_G484METX
GenG4.menu.pnum.GENERIC_G484METX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484METX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET

