stm32duino/Arduino_Core_STM32/boards.txt
# Generic G484PEIx
GenG4.menu.pnum.GENERIC_G484PEIX=Generic G484PEIx
GenG4.menu.pnum.GENERIC_G484PEIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484PEIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484PEIX.build.board=GENERIC_G484PEIX
GenG4.menu.pnum.GENERIC_G484PEIX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484PEIX.build.variant=STM32G4xx/G473P(B-C-E)I_G474P(B-C-E)I_G483PEI_G484PEI

# Generic G484QETx
GenG4.menu.pnum.GENERIC_G484QETX=Generic G484QETx
GenG4.menu.pnum.GENERIC_G484QETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484QETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484QETX.build.board=GENERIC_G484QETX
GenG4.menu.pnum.GENERIC_G484QETX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484QETX.build.variant=STM32G4xx/G473Q(B-C-E)T_G474Q(B-C-E)T_G483QET_G484QET

# Generic G484RETx
GenG4.menu.pnum.GENERIC_G484RETX=Generic G484RETx
GenG4.menu.pnum.GENERIC_G484RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484RETX.build.board=GENERIC_G484RETX
GenG4.menu.pnum.GENERIC_G484RETX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484RETX.build.variant=STM32G4xx/G473R(B-C-E)T_G474R(B-C-E)T_G483RET_G484RET

# Generic G484VEHx
GenG4.menu.pnum.GENERIC_G484VEHX=Generic G484VEHx
GenG4.menu.pnum.GENERIC_G484VEHX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484VEHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484VEHX.build.board=GENERIC_G484VEHX
GenG4.menu.pnum.GENERIC_G484VEHX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484VEHX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G484VETx
GenG4.menu.pnum.GENERIC_G484VETX=Generic G484VETx
GenG4.menu.pnum.GENERIC_G484VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484VETX.build.board=GENERIC_G484VETX
GenG4.menu.pnum.GENERIC_G484VETX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484VETX.build.variant=STM32G4xx/G473V(B-C-E)(H-T)_G474V(B-C-E)(H-T)_G483VE(H-T)_G484VE(H-T)

# Generic G484QETx
GenG4.menu.pnum.GENERIC_G484QETX=Generic G484QETx
GenG4.menu.pnum.GENERIC_G484QETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G484QETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G484QETX.build.board=GENERIC_G484QETX
GenG4.menu.pnum.GENERIC_G484QETX.build.product_line=STM32G484xx
GenG4.menu.pnum.GENERIC_G484QETX.build.variant=STM32G4xx/G473Q(B-C-E)T_G474Q(B-C-E)T_G483QET_G484QET

# Generic G491CCTx
GenG4.menu.pnum.GENERIC_G491CCTX=Generic G491CCTx
GenG4.menu.pnum.GENERIC_G491CCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491CCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491CCTX.build.board=GENERIC_G491CCTX
GenG4.menu.pnum.GENERIC_G491CCTX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491CCTX.build.variant=STM32G4xx/G491C(C-E)T_G4A1CET

# Generic G491CETx
GenG4.menu.pnum.GENERIC_G491CETX=Generic G491CETx
GenG4.menu.pnum.GENERIC_G491CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491CETX.build.board=GENERIC_G491CETX
GenG4.menu.pnum.GENERIC_G491CETX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491CETX.build.variant=STM32G4xx/G491C(C-E)T_G4A1CET

# Generic G491KCUx
GenG4.menu.pnum.GENERIC_G491KCUX=Generic G491KCUx
GenG4.menu.pnum.GENERIC_G491KCUX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491KCUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491KCUX.build.board=GENERIC_G491KCUX
GenG4.menu.pnum.GENERIC_G491KCUX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491KCUX.build.variant=STM32G4xx/G491K(C-E)U_G4A1KEU

# Generic G491KEUx
GenG4.menu.pnum.GENERIC_G491KEUX=Generic G491KEUx
GenG4.menu.pnum.GENERIC_G491KEUX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491KEUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491KEUX.build.board=GENERIC_G491KEUX
GenG4.menu.pnum.GENERIC_G491KEUX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491KEUX.build.variant=STM32G4xx/G491K(C-E)U_G4A1KEU

# Generic G491MCSx
GenG4.menu.pnum.GENERIC_G491MCSX=Generic G491MCSx
GenG4.menu.pnum.GENERIC_G491MCSX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491MCSX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491MCSX.build.board=GENERIC_G491MCSX
GenG4.menu.pnum.GENERIC_G491MCSX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491MCSX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)

# Generic G491MESx
GenG4.menu.pnum.GENERIC_G491MESX=Generic G491MESx
GenG4.menu.pnum.GENERIC_G491MESX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491MESX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491MESX.build.board=GENERIC_G491MESX
GenG4.menu.pnum.GENERIC_G491MESX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491MESX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)

# Generic G491MCTx
GenG4.menu.pnum.GENERIC_G491MCTX=Generic G491MCTx
GenG4.menu.pnum.GENERIC_G491MCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491MCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491MCTX.build.board=GENERIC_G491MCTX
GenG4.menu.pnum.GENERIC_G491MCTX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491MCTX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)

# Generic G491METx
GenG4.menu.pnum.GENERIC_G491METX=Generic G491METx
GenG4.menu.pnum.GENERIC_G491METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491METX.build.board=GENERIC_G491METX
GenG4.menu.pnum.GENERIC_G491METX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491METX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)

# Generic G491RCIx
GenG4.menu.pnum.GENERIC_G491RCIX=Generic G491RCIx
GenG4.menu.pnum.GENERIC_G491RCIX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491RCIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491RCIX.build.board=GENERIC_G491RCIX
GenG4.menu.pnum.GENERIC_G491RCIX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491RCIX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G491REIx
GenG4.menu.pnum.GENERIC_G491REIX=Generic G491REIx
GenG4.menu.pnum.GENERIC_G491REIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491REIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491REIX.build.board=GENERIC_G491REIX
GenG4.menu.pnum.GENERIC_G491REIX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491REIX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

