stm32duino/Arduino_Core_STM32/boards.txt
# Generic G491RCTx
GenG4.menu.pnum.GENERIC_G491RCTX=Generic G491RCTx
GenG4.menu.pnum.GENERIC_G491RCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491RCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491RCTX.build.board=GENERIC_G491RCTX
GenG4.menu.pnum.GENERIC_G491RCTX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491RCTX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G491RETx
GenG4.menu.pnum.GENERIC_G491RETX=Generic G491RETx
GenG4.menu.pnum.GENERIC_G491RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491RETX.build.board=GENERIC_G491RETX
GenG4.menu.pnum.GENERIC_G491RETX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491RETX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G491REYx
GenG4.menu.pnum.GENERIC_G491REYX=Generic G491REYx
GenG4.menu.pnum.GENERIC_G491REYX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491REYX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491REYX.build.board=GENERIC_G491REYX
GenG4.menu.pnum.GENERIC_G491REYX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491REYX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G491VCTx
GenG4.menu.pnum.GENERIC_G491VCTX=Generic G491VCTx
GenG4.menu.pnum.GENERIC_G491VCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G491VCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491VCTX.build.board=GENERIC_G491VCTX
GenG4.menu.pnum.GENERIC_G491VCTX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491VCTX.build.variant=STM32G4xx/G491V(C-E)T_G4A1VET

# Generic G491VETx
GenG4.menu.pnum.GENERIC_G491VETX=Generic G491VETx
GenG4.menu.pnum.GENERIC_G491VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G491VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G491VETX.build.board=GENERIC_G491VETX
GenG4.menu.pnum.GENERIC_G491VETX.build.product_line=STM32G491xx
GenG4.menu.pnum.GENERIC_G491VETX.build.variant=STM32G4xx/G491V(C-E)T_G4A1VET

# Generic G4A1REIx
GenG4.menu.pnum.GENERIC_G4A1REIX=Generic G4A1REIx
GenG4.menu.pnum.GENERIC_G4A1REIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1REIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1REIX.build.board=GENERIC_G4A1REIX
GenG4.menu.pnum.GENERIC_G4A1REIX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1REIX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G4A1CETx
GenG4.menu.pnum.GENERIC_G4A1CETX=Generic G4A1CETx
GenG4.menu.pnum.GENERIC_G4A1CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1CETX.build.board=GENERIC_G4A1CETX
GenG4.menu.pnum.GENERIC_G4A1CETX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1CETX.build.variant=STM32G4xx/G491C(C-E)T_G4A1CET

# Generic G4A1KEUx
GenG4.menu.pnum.GENERIC_G4A1KEUX=Generic G4A1KEUx
GenG4.menu.pnum.GENERIC_G4A1KEUX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1KEUX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1KEUX.build.board=GENERIC_G4A1KEUX
GenG4.menu.pnum.GENERIC_G4A1KEUX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1KEUX.build.variant=STM32G4xx/G491K(C-E)U_G4A1KEU

# Generic G4A1MESx
GenG4.menu.pnum.GENERIC_G4A1MESX=Generic G4A1MESx
GenG4.menu.pnum.GENERIC_G4A1MESX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1MESX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1MESX.build.board=GENERIC_G4A1MESX
GenG4.menu.pnum.GENERIC_G4A1MESX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1MESX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)

# Generic G4A1METx
GenG4.menu.pnum.GENERIC_G4A1METX=Generic G4A1METx
GenG4.menu.pnum.GENERIC_G4A1METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1METX.build.board=GENERIC_G4A1METX
GenG4.menu.pnum.GENERIC_G4A1METX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1METX.build.variant=STM32G4xx/G491M(C-E)(S-T)_G4A1ME(S-T)

# Generic G4A1RETx
GenG4.menu.pnum.GENERIC_G4A1RETX=Generic G4A1RETx
GenG4.menu.pnum.GENERIC_G4A1RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1RETX.build.board=GENERIC_G4A1RETX
GenG4.menu.pnum.GENERIC_G4A1RETX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1RETX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G4A1REYx
GenG4.menu.pnum.GENERIC_G4A1REYX=Generic G4A1REYx
GenG4.menu.pnum.GENERIC_G4A1REYX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1REYX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1REYX.build.board=GENERIC_G4A1REYX
GenG4.menu.pnum.GENERIC_G4A1REYX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1REYX.build.variant=STM32G4xx/G491RC(I-T)_G491RE(I-T-Y)_G4A1RE(I-T-Y)

# Generic G4A1VETx
GenG4.menu.pnum.GENERIC_G4A1VETX=Generic G4A1VETx
GenG4.menu.pnum.GENERIC_G4A1VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G4A1VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G4A1VETX.build.board=GENERIC_G4A1VETX
GenG4.menu.pnum.GENERIC_G4A1VETX.build.product_line=STM32G4A1xx
GenG4.menu.pnum.GENERIC_G4A1VETX.build.variant=STM32G4xx/G491V(C-E)T_G4A1VET



# Upload menu
GenG4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenG4.menu.upload_method.swdMethod.upload.protocol=0
GenG4.menu.upload_method.swdMethod.upload.options=
GenG4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenG4.menu.upload_method.serialMethod.upload.protocol=1
GenG4.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenG4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenG4.menu.upload_method.dfuMethod.upload.protocol=2
GenG4.menu.upload_method.dfuMethod.upload.options=
GenG4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic H5
GenH5.name=Generic STM32H5 series

GenH5.build.core=arduino
GenH5.build.board=GenH5
GenH5.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenH5.build.mcu=cortex-m33
GenH5.build.fpu=-mfpu=fpv4-sp-d16
GenH5.build.float-abi=-mfloat-abi=hard
GenH5.build.series=STM32H5xx
GenH5.build.flash_offset=0x0
GenH5.upload.maximum_size=0
GenH5.upload.maximum_data_size=0

# Generic H503RBTx
GenH5.menu.pnum.GENERIC_H503RBTX=Generic H503RBTx
GenH5.menu.pnum.GENERIC_H503RBTX.upload.maximum_size=131072
GenH5.menu.pnum.GENERIC_H503RBTX.upload.maximum_data_size=32768
GenH5.menu.pnum.GENERIC_H503RBTX.build.board=GENERIC_H503RBTX
GenH5.menu.pnum.GENERIC_H503RBTX.build.product_line=STM32H503xx
GenH5.menu.pnum.GENERIC_H503RBTX.build.variant=STM32H5xx/H503RBT

# Generic H563IIKxQ
GenH5.menu.pnum.GENERIC_H563IIKXQ=Generic H563IIKxQ
GenH5.menu.pnum.GENERIC_H563IIKXQ.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H563IIKXQ.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H563IIKXQ.build.board=GENERIC_H563IIKXQ
GenH5.menu.pnum.GENERIC_H563IIKXQ.build.product_line=STM32H563xx
GenH5.menu.pnum.GENERIC_H563IIKXQ.build.variant=STM32H5xx/H563IIKxQ

# Generic H563ZGTx
GenH5.menu.pnum.GENERIC_H563ZGTX=Generic H563ZGTx
GenH5.menu.pnum.GENERIC_H563ZGTX.upload.maximum_size=1048576
GenH5.menu.pnum.GENERIC_H563ZGTX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H563ZGTX.build.board=GENERIC_H563ZGTX
GenH5.menu.pnum.GENERIC_H563ZGTX.build.product_line=STM32H563xx
GenH5.menu.pnum.GENERIC_H563ZGTX.build.variant=STM32H5xx/H563Z(G-I)T

