stm32duino/Arduino_Core_STM32/boards.txt
# Generic H563ZITx
GenH5.menu.pnum.GENERIC_H563ZITX=Generic H563ZITx
GenH5.menu.pnum.GENERIC_H563ZITX.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H563ZITX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H563ZITX.build.board=GENERIC_H563ZITX
GenH5.menu.pnum.GENERIC_H563ZITX.build.product_line=STM32H563xx
GenH5.menu.pnum.GENERIC_H563ZITX.build.variant=STM32H5xx/H563Z(G-I)T

# Generic H573IIKxQ
GenH5.menu.pnum.GENERIC_H573IIKXQ=Generic H573IIKxQ
GenH5.menu.pnum.GENERIC_H573IIKXQ.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H573IIKXQ.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H573IIKXQ.build.board=GENERIC_H573IIKXQ
GenH5.menu.pnum.GENERIC_H573IIKXQ.build.product_line=STM32H573xx
GenH5.menu.pnum.GENERIC_H573IIKXQ.build.variant=STM32H5xx/H573IIKxQ

# Generic H573ZITx
GenH5.menu.pnum.GENERIC_H573ZITX=Generic H573ZITx
GenH5.menu.pnum.GENERIC_H573ZITX.upload.maximum_size=2097152
GenH5.menu.pnum.GENERIC_H573ZITX.upload.maximum_data_size=655360
GenH5.menu.pnum.GENERIC_H573ZITX.build.board=GENERIC_H573ZITX
GenH5.menu.pnum.GENERIC_H573ZITX.build.product_line=STM32H573xx
GenH5.menu.pnum.GENERIC_H573ZITX.build.variant=STM32H5xx/H573ZIT

# Upload menu
GenH5.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenH5.menu.upload_method.swdMethod.upload.protocol=0
GenH5.menu.upload_method.swdMethod.upload.options=
GenH5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenH5.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenH5.menu.upload_method.serialMethod.upload.protocol=1
GenH5.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenH5.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenH5.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenH5.menu.upload_method.dfuMethod.upload.protocol=2
GenH5.menu.upload_method.dfuMethod.upload.options=
GenH5.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic H7
GenH7.name=Generic STM32H7 Series

GenH7.build.core=arduino
GenH7.build.board=GenH7
GenH7.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial}
GenH7.build.fpu=-mfpu=fpv4-sp-d16
GenH7.build.float-abi=-mfloat-abi=hard
GenH7.build.series=STM32H7xx
GenH7.build.mcu=cortex-m7
GenH7.build.flash_offset=0x0
GenH7.upload.maximum_size=0
GenH7.upload.maximum_data_size=0

# Daisy Seed board
GenH7.menu.pnum.DAISY_SEED=Daisy Seed
GenH7.menu.pnum.DAISY_SEED.upload.maximum_size=131072
GenH7.menu.pnum.DAISY_SEED.upload.maximum_data_size=524288
GenH7.menu.pnum.DAISY_SEED.build.board=DAISY_SEED
GenH7.menu.pnum.DAISY_SEED.build.product_line=STM32H750xx
GenH7.menu.pnum.DAISY_SEED.build.variant_h=variant_{build.board}.h
GenH7.menu.pnum.DAISY_SEED.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)
GenH7.menu.pnum.DAISY_SEED.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenH7.menu.pnum.DAISY_SEED.build.ldscript=DAISY_SEED.ld

# Daisy Patch SM board
GenH7.menu.pnum.DAISY_PATCH_SM=Daisy Patch SM
GenH7.menu.pnum.DAISY_PATCH_SM.upload.maximum_size=131072
GenH7.menu.pnum.DAISY_PATCH_SM.upload.maximum_data_size=524288
GenH7.menu.pnum.DAISY_PATCH_SM.build.board=DAISY_PATCH_SM
GenH7.menu.pnum.DAISY_PATCH_SM.build.product_line=STM32H750xx
GenH7.menu.pnum.DAISY_PATCH_SM.build.variant_h=variant_{build.board}.h
GenH7.menu.pnum.DAISY_PATCH_SM.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)
GenH7.menu.pnum.DAISY_PATCH_SM.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenH7.menu.pnum.DAISY_PATCH_SM.build.ldscript=DAISY_SEED.ld

# Daisy Petal SM board
GenH7.menu.pnum.DAISY_PETAL_SM=Daisy Petal SM
GenH7.menu.pnum.DAISY_PETAL_SM.upload.maximum_size=131072
GenH7.menu.pnum.DAISY_PETAL_SM.upload.maximum_data_size=524288
GenH7.menu.pnum.DAISY_PETAL_SM.build.board=DAISY_PETAL_SM
GenH7.menu.pnum.DAISY_PETAL_SM.build.product_line=STM32H750xx
GenH7.menu.pnum.DAISY_PETAL_SM.build.variant_h=variant_{build.board}.h
GenH7.menu.pnum.DAISY_PETAL_SM.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)
GenH7.menu.pnum.DAISY_PETAL_SM.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
GenH7.menu.pnum.DAISY_PETAL_SM.build.ldscript=DAISY_SEED.ld

# DevEBoxH743VITX
GenH7.menu.pnum.DevEBoxH743VITX=DevEBox H743VITX
GenH7.menu.pnum.DevEBoxH743VITX.upload.maximum_size=2097152
GenH7.menu.pnum.DevEBoxH743VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.DevEBoxH743VITX.build.board=DevEBoxH743VITX
GenH7.menu.pnum.DevEBoxH743VITX.build.product_line=STM32H743xx
GenH7.menu.pnum.DevEBoxH743VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.DevEBoxH743VITX.build.variant_h=variant_DevEBoxH7xx.h
GenH7.menu.pnum.DevEBoxH743VITX.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# DevEBoxH750VBTX
GenH7.menu.pnum.DevEBoxH750VBTX=DevEBox H750VBTX
GenH7.menu.pnum.DevEBoxH750VBTX.upload.maximum_size=131072
GenH7.menu.pnum.DevEBoxH750VBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.DevEBoxH750VBTX.build.board=DevEBoxH750VBTX
GenH7.menu.pnum.DevEBoxH750VBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.DevEBoxH750VBTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.DevEBoxH750VBTX.build.variant_h=variant_DevEBoxH7xx.h
GenH7.menu.pnum.DevEBoxH750VBTX.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# WeAct MiniSTM32H743VITX
GenH7.menu.pnum.WeActMiniH743VITX=WeAct MiniSTM32H743VITX
GenH7.menu.pnum.WeActMiniH743VITX.upload.maximum_size=2097152
GenH7.menu.pnum.WeActMiniH743VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.WeActMiniH743VITX.build.board=WeActMiniH743VITX
GenH7.menu.pnum.WeActMiniH743VITX.build.product_line=STM32H743xx
GenH7.menu.pnum.WeActMiniH743VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.WeActMiniH743VITX.build.variant_h=variant_WeActMiniH7xx.h
GenH7.menu.pnum.WeActMiniH743VITX.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# WeAct MiniSTM32H750VBTX
GenH7.menu.pnum.WeActMiniH750VBTX=WeAct MiniSTM32H750VBTX
GenH7.menu.pnum.WeActMiniH750VBTX.upload.maximum_size=131072
GenH7.menu.pnum.WeActMiniH750VBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.WeActMiniH750VBTX.build.board=WeActMiniH750VBTX
GenH7.menu.pnum.WeActMiniH750VBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.WeActMiniH750VBTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
GenH7.menu.pnum.WeActMiniH750VBTX.build.variant_h=variant_WeActMiniH7xx.h
GenH7.menu.pnum.WeActMiniH750VBTX.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Generic H723ZETx
GenH7.menu.pnum.GENERIC_H723ZETX=Generic H723ZETx
GenH7.menu.pnum.GENERIC_H723ZETX.upload.maximum_size=524288
GenH7.menu.pnum.GENERIC_H723ZETX.upload.maximum_data_size=327680
GenH7.menu.pnum.GENERIC_H723ZETX.build.board=GENERIC_H723ZETX
GenH7.menu.pnum.GENERIC_H723ZETX.build.product_line=STM32H723xx
GenH7.menu.pnum.GENERIC_H723ZETX.build.variant=STM32H7xx/H723Z(E-G)T_H730ZBT_H733ZGT

# Generic H723ZGTx
GenH7.menu.pnum.GENERIC_H723ZGTX=Generic H723ZGTx
GenH7.menu.pnum.GENERIC_H723ZGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H723ZGTX.upload.maximum_data_size=327680
GenH7.menu.pnum.GENERIC_H723ZGTX.build.board=GENERIC_H723ZGTX
GenH7.menu.pnum.GENERIC_H723ZGTX.build.product_line=STM32H723xx
GenH7.menu.pnum.GENERIC_H723ZGTX.build.variant=STM32H7xx/H723Z(E-G)T_H730ZBT_H733ZGT

# Generic H730ZBTx
GenH7.menu.pnum.GENERIC_H730ZBTX=Generic H730ZBTx
GenH7.menu.pnum.GENERIC_H730ZBTX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H730ZBTX.upload.maximum_data_size=327680
GenH7.menu.pnum.GENERIC_H730ZBTX.build.board=GENERIC_H730ZBTX
GenH7.menu.pnum.GENERIC_H730ZBTX.build.product_line=STM32H730xx
GenH7.menu.pnum.GENERIC_H730ZBTX.build.variant=STM32H7xx/H723Z(E-G)T_H730ZBT_H733ZGT

