stm32duino/Arduino_Core_STM32/boards.txt
# Generic L010K4Tx
GenL0.menu.pnum.GENERIC_L010K4TX=Generic L010K4Tx
GenL0.menu.pnum.GENERIC_L010K4TX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L010K4TX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L010K4TX.build.board=GENERIC_L010K4TX
GenL0.menu.pnum.GENERIC_L010K4TX.build.product_line=STM32L010x4
GenL0.menu.pnum.GENERIC_L010K4TX.build.variant=STM32L0xx/L010K4T_L011K(3-4)T_L021K4T

# Generic L010R8Tx
GenL0.menu.pnum.GENERIC_L010R8TX=Generic L010R8Tx
GenL0.menu.pnum.GENERIC_L010R8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L010R8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L010R8TX.build.board=GENERIC_L010R8TX
GenL0.menu.pnum.GENERIC_L010R8TX.build.product_line=STM32L010x8
GenL0.menu.pnum.GENERIC_L010R8TX.build.variant=STM32L0xx/L010R8T

# Generic L010RBTx
GenL0.menu.pnum.GENERIC_L010RBTX=Generic L010RBTx
GenL0.menu.pnum.GENERIC_L010RBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L010RBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L010RBTX.build.board=GENERIC_L010RBTX
GenL0.menu.pnum.GENERIC_L010RBTX.build.product_line=STM32L010xB
GenL0.menu.pnum.GENERIC_L010RBTX.build.variant=STM32L0xx/L010RBT

# Generic L011D3Px
GenL0.menu.pnum.GENERIC_L011D3PX=Generic L011D3Px
GenL0.menu.pnum.GENERIC_L011D3PX.upload.maximum_size=8192
GenL0.menu.pnum.GENERIC_L011D3PX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011D3PX.build.board=GENERIC_L011D3PX
GenL0.menu.pnum.GENERIC_L011D3PX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011D3PX.build.variant=STM32L0xx/L011D(3-4)P_L021D4P

# Generic L011D4Px
GenL0.menu.pnum.GENERIC_L011D4PX=Generic L011D4Px
GenL0.menu.pnum.GENERIC_L011D4PX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L011D4PX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011D4PX.build.board=GENERIC_L011D4PX
GenL0.menu.pnum.GENERIC_L011D4PX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011D4PX.build.variant=STM32L0xx/L011D(3-4)P_L021D4P

# Generic L011E3Yx
GenL0.menu.pnum.GENERIC_L011E3YX=Generic L011E3Yx
GenL0.menu.pnum.GENERIC_L011E3YX.upload.maximum_size=8192
GenL0.menu.pnum.GENERIC_L011E3YX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011E3YX.build.board=GENERIC_L011E3YX
GenL0.menu.pnum.GENERIC_L011E3YX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011E3YX.build.variant=STM32L0xx/L011E(3-4)Y

# Generic L011E4Yx
GenL0.menu.pnum.GENERIC_L011E4YX=Generic L011E4Yx
GenL0.menu.pnum.GENERIC_L011E4YX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L011E4YX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011E4YX.build.board=GENERIC_L011E4YX
GenL0.menu.pnum.GENERIC_L011E4YX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011E4YX.build.variant=STM32L0xx/L011E(3-4)Y

# Generic L011F3Px
GenL0.menu.pnum.GENERIC_L011F3PX=Generic L011F3Px
GenL0.menu.pnum.GENERIC_L011F3PX.upload.maximum_size=8192
GenL0.menu.pnum.GENERIC_L011F3PX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011F3PX.build.board=GENERIC_L011F3PX
GenL0.menu.pnum.GENERIC_L011F3PX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011F3PX.build.variant=STM32L0xx/L010F4P_L011F(3-4)P_L021F4P

# Generic L011F4Px
GenL0.menu.pnum.GENERIC_L011F4PX=Generic L011F4Px
GenL0.menu.pnum.GENERIC_L011F4PX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L011F4PX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011F4PX.build.board=GENERIC_L011F4PX
GenL0.menu.pnum.GENERIC_L011F4PX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011F4PX.build.variant=STM32L0xx/L010F4P_L011F(3-4)P_L021F4P

# Generic L011F3Ux
GenL0.menu.pnum.GENERIC_L011F3UX=Generic L011F3Ux
GenL0.menu.pnum.GENERIC_L011F3UX.upload.maximum_size=8192
GenL0.menu.pnum.GENERIC_L011F3UX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011F3UX.build.board=GENERIC_L011F3UX
GenL0.menu.pnum.GENERIC_L011F3UX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011F3UX.build.variant=STM32L0xx/L011F(3-4)U_L021F4U

# Generic L011F4Ux
GenL0.menu.pnum.GENERIC_L011F4UX=Generic L011F4Ux
GenL0.menu.pnum.GENERIC_L011F4UX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L011F4UX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011F4UX.build.board=GENERIC_L011F4UX
GenL0.menu.pnum.GENERIC_L011F4UX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011F4UX.build.variant=STM32L0xx/L011F(3-4)U_L021F4U

# Generic L011G3Ux
GenL0.menu.pnum.GENERIC_L011G3UX=Generic L011G3Ux
GenL0.menu.pnum.GENERIC_L011G3UX.upload.maximum_size=8192
GenL0.menu.pnum.GENERIC_L011G3UX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011G3UX.build.board=GENERIC_L011G3UX
GenL0.menu.pnum.GENERIC_L011G3UX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011G3UX.build.variant=STM32L0xx/L011G(3-4)U_L021G4U

# Generic L011G4Ux
GenL0.menu.pnum.GENERIC_L011G4UX=Generic L011G4Ux
GenL0.menu.pnum.GENERIC_L011G4UX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L011G4UX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011G4UX.build.board=GENERIC_L011G4UX
GenL0.menu.pnum.GENERIC_L011G4UX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011G4UX.build.variant=STM32L0xx/L011G(3-4)U_L021G4U

# Generic L011K3Tx
GenL0.menu.pnum.GENERIC_L011K3TX=Generic L011K3Tx
GenL0.menu.pnum.GENERIC_L011K3TX.upload.maximum_size=8192
GenL0.menu.pnum.GENERIC_L011K3TX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011K3TX.build.board=GENERIC_L011K3TX
GenL0.menu.pnum.GENERIC_L011K3TX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011K3TX.build.variant=STM32L0xx/L010K4T_L011K(3-4)T_L021K4T

# Generic L011K3Ux
GenL0.menu.pnum.GENERIC_L011K3UX=Generic L011K3Ux
GenL0.menu.pnum.GENERIC_L011K3UX.upload.maximum_size=8192
GenL0.menu.pnum.GENERIC_L011K3UX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011K3UX.build.board=GENERIC_L011K3UX
GenL0.menu.pnum.GENERIC_L011K3UX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011K3UX.build.variant=STM32L0xx/L011K(3-4)U_L021K4U

# Generic L011K4Tx
GenL0.menu.pnum.GENERIC_L011K4TX=Generic L011K4Tx
GenL0.menu.pnum.GENERIC_L011K4TX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L011K4TX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011K4TX.build.board=GENERIC_L011K4TX
GenL0.menu.pnum.GENERIC_L011K4TX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011K4TX.build.variant=STM32L0xx/L010K4T_L011K(3-4)T_L021K4T

# Generic L011K4Ux
GenL0.menu.pnum.GENERIC_L011K4UX=Generic L011K4Ux
GenL0.menu.pnum.GENERIC_L011K4UX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L011K4UX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L011K4UX.build.board=GENERIC_L011K4UX
GenL0.menu.pnum.GENERIC_L011K4UX.build.product_line=STM32L011xx
GenL0.menu.pnum.GENERIC_L011K4UX.build.variant=STM32L0xx/L011K(3-4)U_L021K4U

# Generic L021F4Px
GenL0.menu.pnum.GENERIC_L021F4PX=Generic L021F4Px
GenL0.menu.pnum.GENERIC_L021F4PX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L021F4PX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L021F4PX.build.board=GENERIC_L021F4PX
GenL0.menu.pnum.GENERIC_L021F4PX.build.product_line=STM32L021xx
GenL0.menu.pnum.GENERIC_L021F4PX.build.variant=STM32L0xx/L010F4P_L011F(3-4)P_L021F4P

# Generic L021K4Tx
GenL0.menu.pnum.GENERIC_L021K4TX=Generic L021K4Tx
GenL0.menu.pnum.GENERIC_L021K4TX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L021K4TX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L021K4TX.build.board=GENERIC_L021K4TX
GenL0.menu.pnum.GENERIC_L021K4TX.build.product_line=STM32L021xx
GenL0.menu.pnum.GENERIC_L021K4TX.build.variant=STM32L0xx/L010K4T_L011K(3-4)T_L021K4T

