stm32duino/Arduino_Core_STM32/boards.txt
# Generic L021D4Px
GenL0.menu.pnum.GENERIC_L021D4PX=Generic L021D4Px
GenL0.menu.pnum.GENERIC_L021D4PX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L021D4PX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L021D4PX.build.board=GENERIC_L021D4PX
GenL0.menu.pnum.GENERIC_L021D4PX.build.product_line=STM32L021xx
GenL0.menu.pnum.GENERIC_L021D4PX.build.variant=STM32L0xx/L011D(3-4)P_L021D4P

# Generic L021F4Ux
GenL0.menu.pnum.GENERIC_L021F4UX=Generic L021F4Ux
GenL0.menu.pnum.GENERIC_L021F4UX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L021F4UX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L021F4UX.build.board=GENERIC_L021F4UX
GenL0.menu.pnum.GENERIC_L021F4UX.build.product_line=STM32L021xx
GenL0.menu.pnum.GENERIC_L021F4UX.build.variant=STM32L0xx/L011F(3-4)U_L021F4U

# Generic L021G4Ux
GenL0.menu.pnum.GENERIC_L021G4UX=Generic L021G4Ux
GenL0.menu.pnum.GENERIC_L021G4UX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L021G4UX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L021G4UX.build.board=GENERIC_L021G4UX
GenL0.menu.pnum.GENERIC_L021G4UX.build.product_line=STM32L021xx
GenL0.menu.pnum.GENERIC_L021G4UX.build.variant=STM32L0xx/L011G(3-4)U_L021G4U

# Generic L021K4Ux
GenL0.menu.pnum.GENERIC_L021K4UX=Generic L021K4Ux
GenL0.menu.pnum.GENERIC_L021K4UX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L021K4UX.upload.maximum_data_size=2048
GenL0.menu.pnum.GENERIC_L021K4UX.build.board=GENERIC_L021K4UX
GenL0.menu.pnum.GENERIC_L021K4UX.build.product_line=STM32L021xx
GenL0.menu.pnum.GENERIC_L021K4UX.build.variant=STM32L0xx/L011K(3-4)U_L021K4U

# Generic L031C4Tx
GenL0.menu.pnum.GENERIC_L031C4TX=Generic L031C4Tx
GenL0.menu.pnum.GENERIC_L031C4TX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L031C4TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031C4TX.build.board=GENERIC_L031C4TX
GenL0.menu.pnum.GENERIC_L031C4TX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031C4TX.build.variant=STM32L0xx/L031C(4-6)(T-U)_L041C4T_L041C6(T-U)

# Generic L031C6Tx
GenL0.menu.pnum.GENERIC_L031C6TX=Generic L031C6Tx
GenL0.menu.pnum.GENERIC_L031C6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L031C6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031C6TX.build.board=GENERIC_L031C6TX
GenL0.menu.pnum.GENERIC_L031C6TX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031C6TX.build.variant=STM32L0xx/L031C(4-6)(T-U)_L041C4T_L041C6(T-U)

# Generic L031C4Ux
GenL0.menu.pnum.GENERIC_L031C4UX=Generic L031C4Ux
GenL0.menu.pnum.GENERIC_L031C4UX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L031C4UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031C4UX.build.board=GENERIC_L031C4UX
GenL0.menu.pnum.GENERIC_L031C4UX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031C4UX.build.variant=STM32L0xx/L031C(4-6)(T-U)_L041C4T_L041C6(T-U)

# Generic L031C6Ux
GenL0.menu.pnum.GENERIC_L031C6UX=Generic L031C6Ux
GenL0.menu.pnum.GENERIC_L031C6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L031C6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031C6UX.build.board=GENERIC_L031C6UX
GenL0.menu.pnum.GENERIC_L031C6UX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031C6UX.build.variant=STM32L0xx/L031C(4-6)(T-U)_L041C4T_L041C6(T-U)

# Generic L031E4Yx
GenL0.menu.pnum.GENERIC_L031E4YX=Generic L031E4Yx
GenL0.menu.pnum.GENERIC_L031E4YX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L031E4YX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031E4YX.build.board=GENERIC_L031E4YX
GenL0.menu.pnum.GENERIC_L031E4YX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031E4YX.build.variant=STM32L0xx/L031E(4-6)Y_L041E6Y

# Generic L031E6Yx
GenL0.menu.pnum.GENERIC_L031E6YX=Generic L031E6Yx
GenL0.menu.pnum.GENERIC_L031E6YX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L031E6YX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031E6YX.build.board=GENERIC_L031E6YX
GenL0.menu.pnum.GENERIC_L031E6YX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031E6YX.build.variant=STM32L0xx/L031E(4-6)Y_L041E6Y

# Generic L031F4Px
GenL0.menu.pnum.GENERIC_L031F4PX=Generic L031F4Px
GenL0.menu.pnum.GENERIC_L031F4PX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L031F4PX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031F4PX.build.board=GENERIC_L031F4PX
GenL0.menu.pnum.GENERIC_L031F4PX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031F4PX.build.variant=STM32L0xx/L031F(4-6)P_L041F6P

# Generic L031F6Px
GenL0.menu.pnum.GENERIC_L031F6PX=Generic L031F6Px
GenL0.menu.pnum.GENERIC_L031F6PX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L031F6PX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031F6PX.build.board=GENERIC_L031F6PX
GenL0.menu.pnum.GENERIC_L031F6PX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031F6PX.build.variant=STM32L0xx/L031F(4-6)P_L041F6P

# Generic L031G4Ux
GenL0.menu.pnum.GENERIC_L031G4UX=Generic L031G4Ux
GenL0.menu.pnum.GENERIC_L031G4UX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L031G4UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031G4UX.build.board=GENERIC_L031G4UX
GenL0.menu.pnum.GENERIC_L031G4UX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031G4UX.build.variant=STM32L0xx/L031G(4-6)U_L041G6U

# Generic L031G6Ux
GenL0.menu.pnum.GENERIC_L031G6UX=Generic L031G6Ux
GenL0.menu.pnum.GENERIC_L031G6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L031G6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031G6UX.build.board=GENERIC_L031G6UX
GenL0.menu.pnum.GENERIC_L031G6UX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031G6UX.build.variant=STM32L0xx/L031G(4-6)U_L041G6U

# Generic L031K4Tx
GenL0.menu.pnum.GENERIC_L031K4TX=Generic L031K4Tx
GenL0.menu.pnum.GENERIC_L031K4TX.upload.maximum_size=16384
GenL0.menu.pnum.GENERIC_L031K4TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031K4TX.build.board=GENERIC_L031K4TX
GenL0.menu.pnum.GENERIC_L031K4TX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031K4TX.build.variant=STM32L0xx/L031K(4-6)T_L041K6T

# Generic L031K6Tx
GenL0.menu.pnum.GENERIC_L031K6TX=Generic L031K6Tx
GenL0.menu.pnum.GENERIC_L031K6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L031K6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L031K6TX.build.board=GENERIC_L031K6TX
GenL0.menu.pnum.GENERIC_L031K6TX.build.product_line=STM32L031xx
GenL0.menu.pnum.GENERIC_L031K6TX.build.variant=STM32L0xx/L031K(4-6)T_L041K6T

