stm32duino/Arduino_Core_STM32/boards.txt
# Generic L052K6Tx
GenL0.menu.pnum.GENERIC_L052K6TX=Generic L052K6Tx
GenL0.menu.pnum.GENERIC_L052K6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052K6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052K6TX.build.board=GENERIC_L052K6TX
GenL0.menu.pnum.GENERIC_L052K6TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052K6TX.build.variant=STM32L0xx/L052K(6-8)T_L062K8T

# Generic L052K8Tx
GenL0.menu.pnum.GENERIC_L052K8TX=Generic L052K8Tx
GenL0.menu.pnum.GENERIC_L052K8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052K8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052K8TX.build.board=GENERIC_L052K8TX
GenL0.menu.pnum.GENERIC_L052K8TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052K8TX.build.variant=STM32L0xx/L052K(6-8)T_L062K8T

# Generic L052R6Hx
GenL0.menu.pnum.GENERIC_L052R6HX=Generic L052R6Hx
GenL0.menu.pnum.GENERIC_L052R6HX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052R6HX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052R6HX.build.board=GENERIC_L052R6HX
GenL0.menu.pnum.GENERIC_L052R6HX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052R6HX.build.variant=STM32L0xx/L052R(6-8)H_L053R(6-8)H

# Generic L052R8Hx
GenL0.menu.pnum.GENERIC_L052R8HX=Generic L052R8Hx
GenL0.menu.pnum.GENERIC_L052R8HX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052R8HX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052R8HX.build.board=GENERIC_L052R8HX
GenL0.menu.pnum.GENERIC_L052R8HX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052R8HX.build.variant=STM32L0xx/L052R(6-8)H_L053R(6-8)H

# Generic L052R6Tx
GenL0.menu.pnum.GENERIC_L052R6TX=Generic L052R6Tx
GenL0.menu.pnum.GENERIC_L052R6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052R6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052R6TX.build.board=GENERIC_L052R6TX
GenL0.menu.pnum.GENERIC_L052R6TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052R6TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T

# Generic L052R8Tx
GenL0.menu.pnum.GENERIC_L052R8TX=Generic L052R8Tx
GenL0.menu.pnum.GENERIC_L052R8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052R8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052R8TX.build.board=GENERIC_L052R8TX
GenL0.menu.pnum.GENERIC_L052R8TX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052R8TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T

# Generic L052T6Yx
GenL0.menu.pnum.GENERIC_L052T6YX=Generic L052T6Yx
GenL0.menu.pnum.GENERIC_L052T6YX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L052T6YX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052T6YX.build.board=GENERIC_L052T6YX
GenL0.menu.pnum.GENERIC_L052T6YX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052T6YX.build.variant=STM32L0xx/L052T6Y_L052T8(F-Y)

# Generic L052T8Yx
GenL0.menu.pnum.GENERIC_L052T8YX=Generic L052T8Yx
GenL0.menu.pnum.GENERIC_L052T8YX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052T8YX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052T8YX.build.board=GENERIC_L052T8YX
GenL0.menu.pnum.GENERIC_L052T8YX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052T8YX.build.variant=STM32L0xx/L052T6Y_L052T8(F-Y)

# Generic L052T8Fx
GenL0.menu.pnum.GENERIC_L052T8FX=Generic L052T8Fx
GenL0.menu.pnum.GENERIC_L052T8FX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L052T8FX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L052T8FX.build.board=GENERIC_L052T8FX
GenL0.menu.pnum.GENERIC_L052T8FX.build.product_line=STM32L052xx
GenL0.menu.pnum.GENERIC_L052T8FX.build.variant=STM32L0xx/L052T6Y_L052T8(F-Y)

# Generic L053C6Tx
GenL0.menu.pnum.GENERIC_L053C6TX=Generic L053C6Tx
GenL0.menu.pnum.GENERIC_L053C6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L053C6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L053C6TX.build.board=GENERIC_L053C6TX
GenL0.menu.pnum.GENERIC_L053C6TX.build.product_line=STM32L053xx
GenL0.menu.pnum.GENERIC_L053C6TX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)

# Generic L053C8Tx
GenL0.menu.pnum.GENERIC_L053C8TX=Generic L053C8Tx
GenL0.menu.pnum.GENERIC_L053C8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L053C8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L053C8TX.build.board=GENERIC_L053C8TX
GenL0.menu.pnum.GENERIC_L053C8TX.build.product_line=STM32L053xx
GenL0.menu.pnum.GENERIC_L053C8TX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)

# Generic L053C6Ux
GenL0.menu.pnum.GENERIC_L053C6UX=Generic L053C6Ux
GenL0.menu.pnum.GENERIC_L053C6UX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L053C6UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L053C6UX.build.board=GENERIC_L053C6UX
GenL0.menu.pnum.GENERIC_L053C6UX.build.product_line=STM32L053xx
GenL0.menu.pnum.GENERIC_L053C6UX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)

# Generic L053C8Ux
GenL0.menu.pnum.GENERIC_L053C8UX=Generic L053C8Ux
GenL0.menu.pnum.GENERIC_L053C8UX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L053C8UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L053C8UX.build.board=GENERIC_L053C8UX
GenL0.menu.pnum.GENERIC_L053C8UX.build.product_line=STM32L053xx
GenL0.menu.pnum.GENERIC_L053C8UX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)

# Generic L053R6Hx
GenL0.menu.pnum.GENERIC_L053R6HX=Generic L053R6Hx
GenL0.menu.pnum.GENERIC_L053R6HX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L053R6HX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L053R6HX.build.board=GENERIC_L053R6HX
GenL0.menu.pnum.GENERIC_L053R6HX.build.product_line=STM32L053xx
GenL0.menu.pnum.GENERIC_L053R6HX.build.variant=STM32L0xx/L052R(6-8)H_L053R(6-8)H

# Generic L053R8Hx
GenL0.menu.pnum.GENERIC_L053R8HX=Generic L053R8Hx
GenL0.menu.pnum.GENERIC_L053R8HX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L053R8HX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L053R8HX.build.board=GENERIC_L053R8HX
GenL0.menu.pnum.GENERIC_L053R8HX.build.product_line=STM32L053xx
GenL0.menu.pnum.GENERIC_L053R8HX.build.variant=STM32L0xx/L052R(6-8)H_L053R(6-8)H

# Generic L053R6Tx
GenL0.menu.pnum.GENERIC_L053R6TX=Generic L053R6Tx
GenL0.menu.pnum.GENERIC_L053R6TX.upload.maximum_size=32768
GenL0.menu.pnum.GENERIC_L053R6TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L053R6TX.build.board=GENERIC_L053R6TX
GenL0.menu.pnum.GENERIC_L053R6TX.build.product_line=STM32L053xx
GenL0.menu.pnum.GENERIC_L053R6TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T

# Generic L053R8Tx
GenL0.menu.pnum.GENERIC_L053R8TX=Generic L053R8Tx
GenL0.menu.pnum.GENERIC_L053R8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L053R8TX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L053R8TX.build.board=GENERIC_L053R8TX
GenL0.menu.pnum.GENERIC_L053R8TX.build.product_line=STM32L053xx
GenL0.menu.pnum.GENERIC_L053R8TX.build.variant=STM32L0xx/L052R(6-8)T_L053R(6-8)T_L063R8T

# Generic L062C8Ux
GenL0.menu.pnum.GENERIC_L062C8UX=Generic L062C8Ux
GenL0.menu.pnum.GENERIC_L062C8UX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L062C8UX.upload.maximum_data_size=8192
GenL0.menu.pnum.GENERIC_L062C8UX.build.board=GENERIC_L062C8UX
GenL0.menu.pnum.GENERIC_L062C8UX.build.product_line=STM32L062xx
GenL0.menu.pnum.GENERIC_L062C8UX.build.variant=STM32L0xx/L052C(6-8)(T-U)_L053C(6-8)(T-U)_L062C8U_L063C8(T-U)

