stm32duino/Arduino_Core_STM32/boards.txt
# Generic L073CBTx
GenL0.menu.pnum.GENERIC_L073CBTX=Generic L073CBTx
GenL0.menu.pnum.GENERIC_L073CBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L073CBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073CBTX.build.board=GENERIC_L073CBTX
GenL0.menu.pnum.GENERIC_L073CBTX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073CBTX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)

# Generic L073CBUx
GenL0.menu.pnum.GENERIC_L073CBUX=Generic L073CBUx
GenL0.menu.pnum.GENERIC_L073CBUX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L073CBUX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073CBUX.build.board=GENERIC_L073CBUX
GenL0.menu.pnum.GENERIC_L073CBUX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073CBUX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)

# Generic L073CZTx
GenL0.menu.pnum.GENERIC_L073CZTX=Generic L073CZTx
GenL0.menu.pnum.GENERIC_L073CZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L073CZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073CZTX.build.board=GENERIC_L073CZTX
GenL0.menu.pnum.GENERIC_L073CZTX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073CZTX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)

# Generic L073CZUx
GenL0.menu.pnum.GENERIC_L073CZUX=Generic L073CZUx
GenL0.menu.pnum.GENERIC_L073CZUX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L073CZUX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073CZUX.build.board=GENERIC_L073CZUX
GenL0.menu.pnum.GENERIC_L073CZUX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073CZUX.build.variant=STM32L0xx/L072C(B-Z)(T-U)_L073C(B-Z)(T-U)_L082CZU_L083CBT_L083CZ(T-U)

# Generic L073CZYx
GenL0.menu.pnum.GENERIC_L073CZYX=Generic L073CZYx
GenL0.menu.pnum.GENERIC_L073CZYX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L073CZYX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073CZYX.build.board=GENERIC_L073CZYX
GenL0.menu.pnum.GENERIC_L073CZYX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073CZYX.build.variant=STM32L0xx/L072CBY_L072CZ(E-Y)_L073CZY_L082CZY

# Generic L073RBTx
GenL0.menu.pnum.GENERIC_L073RBTX=Generic L073RBTx
GenL0.menu.pnum.GENERIC_L073RBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L073RBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073RBTX.build.board=GENERIC_L073RBTX
GenL0.menu.pnum.GENERIC_L073RBTX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073RBTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T

# Generic L073RBHx
GenL0.menu.pnum.GENERIC_L073RBHX=Generic L073RBHx
GenL0.menu.pnum.GENERIC_L073RBHX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L073RBHX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073RBHX.build.board=GENERIC_L073RBHX
GenL0.menu.pnum.GENERIC_L073RBHX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073RBHX.build.variant=STM32L0xx/L072R(B-Z)(H-I)_L073RBH_L073RZ(H-I)_L083R(B-Z)H

# Generic L073RZHx
GenL0.menu.pnum.GENERIC_L073RZHX=Generic L073RZHx
GenL0.menu.pnum.GENERIC_L073RZHX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L073RZHX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073RZHX.build.board=GENERIC_L073RZHX
GenL0.menu.pnum.GENERIC_L073RZHX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073RZHX.build.variant=STM32L0xx/L072R(B-Z)(H-I)_L073RBH_L073RZ(H-I)_L083R(B-Z)H

# Generic L073RZIx
GenL0.menu.pnum.GENERIC_L073RZIX=Generic L073RZIx
GenL0.menu.pnum.GENERIC_L073RZIX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L073RZIX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073RZIX.build.board=GENERIC_L073RZIX
GenL0.menu.pnum.GENERIC_L073RZIX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073RZIX.build.variant=STM32L0xx/L072R(B-Z)(H-I)_L073RBH_L073RZ(H-I)_L083R(B-Z)H

# Generic L073RZTx
GenL0.menu.pnum.GENERIC_L073RZTX=Generic L073RZTx
GenL0.menu.pnum.GENERIC_L073RZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L073RZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073RZTX.build.board=GENERIC_L073RZTX
GenL0.menu.pnum.GENERIC_L073RZTX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073RZTX.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T

# Generic L073VBIx
GenL0.menu.pnum.GENERIC_L073VBIX=Generic L073VBIx
GenL0.menu.pnum.GENERIC_L073VBIX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L073VBIX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073VBIX.build.board=GENERIC_L073VBIX
GenL0.menu.pnum.GENERIC_L073VBIX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073VBIX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)

# Generic L073VZIx
GenL0.menu.pnum.GENERIC_L073VZIX=Generic L073VZIx
GenL0.menu.pnum.GENERIC_L073VZIX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L073VZIX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073VZIX.build.board=GENERIC_L073VZIX
GenL0.menu.pnum.GENERIC_L073VZIX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073VZIX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)

# Generic L073VBTx
GenL0.menu.pnum.GENERIC_L073VBTX=Generic L073VBTx
GenL0.menu.pnum.GENERIC_L073VBTX.upload.maximum_size=131072
GenL0.menu.pnum.GENERIC_L073VBTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073VBTX.build.board=GENERIC_L073VBTX
GenL0.menu.pnum.GENERIC_L073VBTX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073VBTX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)

# Generic L073VZTx
GenL0.menu.pnum.GENERIC_L073VZTX=Generic L073VZTx
GenL0.menu.pnum.GENERIC_L073VZTX.upload.maximum_size=196608
GenL0.menu.pnum.GENERIC_L073VZTX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073VZTX.build.board=GENERIC_L073VZTX
GenL0.menu.pnum.GENERIC_L073VZTX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073VZTX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)

# Generic L073V8Ix
GenL0.menu.pnum.GENERIC_L073V8IX=Generic L073V8Ix
GenL0.menu.pnum.GENERIC_L073V8IX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L073V8IX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073V8IX.build.board=GENERIC_L073V8IX
GenL0.menu.pnum.GENERIC_L073V8IX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073V8IX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)

# Generic L073V8Tx
GenL0.menu.pnum.GENERIC_L073V8TX=Generic L073V8Tx
GenL0.menu.pnum.GENERIC_L073V8TX.upload.maximum_size=65536
GenL0.menu.pnum.GENERIC_L073V8TX.upload.maximum_data_size=20480
GenL0.menu.pnum.GENERIC_L073V8TX.build.board=GENERIC_L073V8TX
GenL0.menu.pnum.GENERIC_L073V8TX.build.product_line=STM32L073xx
GenL0.menu.pnum.GENERIC_L073V8TX.build.variant=STM32L0xx/L072V(8-B-Z)(I-T)_L073V(8-B-Z)(I-T)_L083V(8-B-Z)(I-T)

