stm32duino/Arduino_Core_STM32/boards.txt
# Generic WB15CCUx
GenWB.menu.pnum.GENERIC_WB15CCUX=Generic WB15CCUx
GenWB.menu.pnum.GENERIC_WB15CCUX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB15CCUX.upload.maximum_data_size=12288
GenWB.menu.pnum.GENERIC_WB15CCUX.build.board=GENERIC_WB15CCUX
GenWB.menu.pnum.GENERIC_WB15CCUX.build.product_line=STM32WB15xx
GenWB.menu.pnum.GENERIC_WB15CCUX.build.variant=STM32WBxx/WB15CCU

# Generic WB55CCUx
GenWB.menu.pnum.GENERIC_WB55CCUX=Generic WB55CCUx
GenWB.menu.pnum.GENERIC_WB55CCUX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55CCUX.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55CCUX.build.board=GENERIC_WB55CCUX
GenWB.menu.pnum.GENERIC_WB55CCUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CCUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U

# Generic WB55CEUx
GenWB.menu.pnum.GENERIC_WB55CEUX=Generic WB55CEUx
GenWB.menu.pnum.GENERIC_WB55CEUX.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55CEUX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55CEUX.build.board=GENERIC_WB55CEUX
GenWB.menu.pnum.GENERIC_WB55CEUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CEUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U

# Generic WB55CGUx
GenWB.menu.pnum.GENERIC_WB55CGUX=Generic WB55CGUx
GenWB.menu.pnum.GENERIC_WB55CGUX.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55CGUX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55CGUX.build.board=GENERIC_WB55CGUX
GenWB.menu.pnum.GENERIC_WB55CGUX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CGUX.build.variant=STM32WBxx/WB35C(C-E)UxA_WB55C(C-E-G)U

# Generic WB5MMGHx
GenWB.menu.pnum.GENERIC_WB5MMGHX=Generic WB5MMGHx
GenWB.menu.pnum.GENERIC_WB5MMGHX.upload.maximum_size=827392
GenWB.menu.pnum.GENERIC_WB5MMGHX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.board=GENERIC_WB5MMGHX
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.product_line=STM32WB5Mxx
GenWB.menu.pnum.GENERIC_WB5MMGHX.build.variant=STM32WBxx/WB5MMGH

# Generic WB55RCVx
GenWB.menu.pnum.GENERIC_WB55RCVX=Generic WB55RCVx
GenWB.menu.pnum.GENERIC_WB55RCVX.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55RCVX.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55RCVX.build.board=GENERIC_WB55RCVX
GenWB.menu.pnum.GENERIC_WB55RCVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RCVX.build.variant=STM32WBxx/WB55R(C-E-G)V

# Generic WB55REVx
GenWB.menu.pnum.GENERIC_WB55REVX=Generic WB55REVx
GenWB.menu.pnum.GENERIC_WB55REVX.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55REVX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55REVX.build.board=GENERIC_WB55REVX
GenWB.menu.pnum.GENERIC_WB55REVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55REVX.build.variant=STM32WBxx/WB55R(C-E-G)V

# Generic WB55RGVx
GenWB.menu.pnum.GENERIC_WB55RGVX=Generic WB55RGVx
GenWB.menu.pnum.GENERIC_WB55RGVX.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55RGVX.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55RGVX.build.board=GENERIC_WB55RGVX
GenWB.menu.pnum.GENERIC_WB55RGVX.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RGVX.build.variant=STM32WBxx/WB55R(C-E-G)V

# Upload menu
GenWB.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWB.menu.upload_method.swdMethod.upload.protocol=0
GenWB.menu.upload_method.swdMethod.upload.options=
GenWB.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWB.menu.upload_method.serialMethod.upload.protocol=1
GenWB.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenWB.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenWB.menu.upload_method.dfuMethod.upload.protocol=2
GenWB.menu.upload_method.dfuMethod.upload.options=
GenWB.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic WL
GenWL.name=Generic STM32WL series

GenWL.build.core=arduino
GenWL.build.board=GenWL
GenWL.build.st_extra_flags=-D{build.product_line} -DUSE_CM4_STARTUP_FILE {build.xSerial}
GenWL.build.mcu=cortex-m4
#GenWL.build.fpu=-mfpu=fpv4-sp-d16
#GenWL.build.float-abi=-mfloat-abi=hard
GenWL.build.series=STM32WLxx
GenWL.build.flash_offset=0x0
GenWL.upload.maximum_size=0
GenWL.upload.maximum_data_size=0

# Generic WL54CCUx
GenWL.menu.pnum.GENERIC_WL54CCUX=Generic WL54CCUx
GenWL.menu.pnum.GENERIC_WL54CCUX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WL54CCUX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WL54CCUX.build.board=GENERIC_WL54CCUX
GenWL.menu.pnum.GENERIC_WL54CCUX.build.product_line=STM32WL54xx
GenWL.menu.pnum.GENERIC_WL54CCUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

# Generic WL54JCIx
GenWL.menu.pnum.GENERIC_WL54JCIX=Generic WL54JCIx
GenWL.menu.pnum.GENERIC_WL54JCIX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WL54JCIX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WL54JCIX.build.board=GENERIC_WL54JCIX
GenWL.menu.pnum.GENERIC_WL54JCIX.build.product_line=STM32WL54xx
GenWL.menu.pnum.GENERIC_WL54JCIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WL55CCUx
GenWL.menu.pnum.GENERIC_WL55CCUX=Generic WL55CCUx
GenWL.menu.pnum.GENERIC_WL55CCUX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WL55CCUX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WL55CCUX.build.board=GENERIC_WL55CCUX
GenWL.menu.pnum.GENERIC_WL55CCUX.build.product_line=STM32WL55xx
GenWL.menu.pnum.GENERIC_WL55CCUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

# Generic WL55JCIx
GenWL.menu.pnum.GENERIC_WL55JCIX=Generic WL55JCIx
GenWL.menu.pnum.GENERIC_WL55JCIX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WL55JCIX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WL55JCIX.build.board=GENERIC_WL55JCIX
GenWL.menu.pnum.GENERIC_WL55JCIX.build.product_line=STM32WL55xx
GenWL.menu.pnum.GENERIC_WL55JCIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE4C8Ux
GenWL.menu.pnum.GENERIC_WLE4C8UX=Generic WLE4C8Ux
GenWL.menu.pnum.GENERIC_WLE4C8UX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE4C8UX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE4C8UX.build.board=GENERIC_WLE4C8UX
GenWL.menu.pnum.GENERIC_WLE4C8UX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4C8UX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

# Generic WLE4CBUx
GenWL.menu.pnum.GENERIC_WLE4CBUX=Generic WLE4CBUx
GenWL.menu.pnum.GENERIC_WLE4CBUX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE4CBUX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE4CBUX.build.board=GENERIC_WLE4CBUX
GenWL.menu.pnum.GENERIC_WLE4CBUX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4CBUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

# Generic WLE4CCUx
GenWL.menu.pnum.GENERIC_WLE4CCUX=Generic WLE4CCUx
GenWL.menu.pnum.GENERIC_WLE4CCUX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE4CCUX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE4CCUX.build.board=GENERIC_WLE4CCUX
GenWL.menu.pnum.GENERIC_WLE4CCUX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4CCUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

