stm32duino/Arduino_Core_STM32/boards.txt
# Generic WLE4J8Ix
GenWL.menu.pnum.GENERIC_WLE4J8IX=Generic WLE4J8Ix
GenWL.menu.pnum.GENERIC_WLE4J8IX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE4J8IX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE4J8IX.build.board=GENERIC_WLE4J8IX
GenWL.menu.pnum.GENERIC_WLE4J8IX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4J8IX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE4JBIx
GenWL.menu.pnum.GENERIC_WLE4JBIX=Generic WLE4JBIx
GenWL.menu.pnum.GENERIC_WLE4JBIX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE4JBIX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE4JBIX.build.board=GENERIC_WLE4JBIX
GenWL.menu.pnum.GENERIC_WLE4JBIX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4JBIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE4JCIx
GenWL.menu.pnum.GENERIC_WLE4JCIX=Generic WLE4JCIx
GenWL.menu.pnum.GENERIC_WLE4JCIX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE4JCIX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE4JCIX.build.board=GENERIC_WLE4JCIX
GenWL.menu.pnum.GENERIC_WLE4JCIX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4JCIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE5C8Ux
GenWL.menu.pnum.GENERIC_WLE5C8UX=Generic WLE5C8Ux
GenWL.menu.pnum.GENERIC_WLE5C8UX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE5C8UX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE5C8UX.build.board=GENERIC_WLE5C8UX
GenWL.menu.pnum.GENERIC_WLE5C8UX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5C8UX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

# Generic WLE5CBUx
GenWL.menu.pnum.GENERIC_WLE5CBUX=Generic WLE5CBUx
GenWL.menu.pnum.GENERIC_WLE5CBUX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE5CBUX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE5CBUX.build.board=GENERIC_WLE5CBUX
GenWL.menu.pnum.GENERIC_WLE5CBUX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5CBUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

# Generic WLE5CCUx
GenWL.menu.pnum.GENERIC_WLE5CCUX=Generic WLE5CCUx
GenWL.menu.pnum.GENERIC_WLE5CCUX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE5CCUX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE5CCUX.build.board=GENERIC_WLE5CCUX
GenWL.menu.pnum.GENERIC_WLE5CCUX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5CCUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

# Generic WLE5J8Ix
GenWL.menu.pnum.GENERIC_WLE5J8IX=Generic WLE5J8Ix
GenWL.menu.pnum.GENERIC_WLE5J8IX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE5J8IX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE5J8IX.build.board=GENERIC_WLE5J8IX
GenWL.menu.pnum.GENERIC_WLE5J8IX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5J8IX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE5JBIx
GenWL.menu.pnum.GENERIC_WLE5JBIX=Generic WLE5JBIx
GenWL.menu.pnum.GENERIC_WLE5JBIX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE5JBIX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE5JBIX.build.board=GENERIC_WLE5JBIX
GenWL.menu.pnum.GENERIC_WLE5JBIX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5JBIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE5JCIx
GenWL.menu.pnum.GENERIC_WLE5JCIX=Generic WLE5JCIx
GenWL.menu.pnum.GENERIC_WLE5JCIX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE5JCIX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE5JCIX.build.board=GENERIC_WLE5JCIX
GenWL.menu.pnum.GENERIC_WLE5JCIX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5JCIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Upload menu
GenWL.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWL.menu.upload_method.swdMethod.upload.protocol=0
GenWL.menu.upload_method.swdMethod.upload.options=
GenWL.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenWL.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWL.menu.upload_method.serialMethod.upload.protocol=1
GenWL.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenWL.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWL.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenWL.menu.upload_method.dfuMethod.upload.protocol=2
GenWL.menu.upload_method.dfuMethod.upload.options=
GenWL.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# 3D printer boards

3dprinter.name=3D printer boards

3dprinter.build.core=arduino
3dprinter.build.board=3dprinter
3dprinter.build.variant_h=variant_{build.board}.h
3dprinter.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
3dprinter.build.flash_offset=0x0
3dprinter.upload.maximum_size=0
3dprinter.upload.maximum_data_size=0

# ARMED_V1 board
3dprinter.menu.pnum.ARMED_V1=Armed V1
3dprinter.menu.pnum.ARMED_V1.upload.maximum_size=524288
3dprinter.menu.pnum.ARMED_V1.upload.maximum_data_size=131072
3dprinter.menu.pnum.ARMED_V1.build.mcu=cortex-m4
3dprinter.menu.pnum.ARMED_V1.build.fpu=-mfpu=fpv4-sp-d16
3dprinter.menu.pnum.ARMED_V1.build.float-abi=-mfloat-abi=hard
3dprinter.menu.pnum.ARMED_V1.build.board=ARMED_V1
3dprinter.menu.pnum.ARMED_V1.build.series=STM32F4xx
3dprinter.menu.pnum.ARMED_V1.build.product_line=STM32F407xx
3dprinter.menu.pnum.ARMED_V1.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
3dprinter.menu.pnum.ARMED_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Big Tree Tech EBB42_V1_1 board
3dprinter.menu.pnum.EBB42_V1_1=Big Tree Tech EBB42 V1.1
3dprinter.menu.pnum.EBB42_V1_1.upload.maximum_size=131072
3dprinter.menu.pnum.EBB42_V1_1.upload.maximum_data_size=147456
3dprinter.menu.pnum.EBB42_V1_1.build.mcu=cortex-m0plus
3dprinter.menu.pnum.EBB42_V1_1.build.board=EBB42_V1_1
3dprinter.menu.pnum.EBB42_V1_1.build.series=STM32G0xx
3dprinter.menu.pnum.EBB42_V1_1.build.product_line=STM32G0B1xx
3dprinter.menu.pnum.EBB42_V1_1.build.variant=STM32G0xx/G0B1C(B-C-E)(T-U)_G0C1C(C-E)(T-U)
3dprinter.menu.pnum.EBB42_V1_1.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

