stm32duino/Arduino_Core_STM32/boards.txt
# FYSETC_S6 board
3dprinter.menu.pnum.FYSETC_S6=FYSETC_S6
3dprinter.menu.pnum.FYSETC_S6.upload.maximum_size=458752
3dprinter.menu.pnum.FYSETC_S6.upload.maximum_data_size=131072
3dprinter.menu.pnum.FYSETC_S6.build.mcu=cortex-m4
3dprinter.menu.pnum.FYSETC_S6.build.fpu=-mfpu=fpv4-sp-d16
3dprinter.menu.pnum.FYSETC_S6.build.float-abi=-mfloat-abi=hard
3dprinter.menu.pnum.FYSETC_S6.build.board=FYSETC_S6
3dprinter.menu.pnum.FYSETC_S6.build.series=STM32F4xx
3dprinter.menu.pnum.FYSETC_S6.build.product_line=STM32F446xx
3dprinter.menu.pnum.FYSETC_S6.build.variant=STM32F4xx/F446V(C-E)T
3dprinter.menu.pnum.FYSETC_S6.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.FYSETC_S6.build.flash_offset=0x10000
3dprinter.menu.pnum.FYSETC_S6.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# Upload menu
3dprinter.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
3dprinter.menu.upload_method.swdMethod.upload.protocol=0
3dprinter.menu.upload_method.swdMethod.upload.options=
3dprinter.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

3dprinter.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
3dprinter.menu.upload_method.serialMethod.upload.protocol=1
3dprinter.menu.upload_method.serialMethod.upload.options={serial.port.file}
3dprinter.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

3dprinter.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
3dprinter.menu.upload_method.dfuMethod.upload.protocol=2
3dprinter.menu.upload_method.dfuMethod.upload.options=
3dprinter.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Blues Wireless boards

BluesW.name=Blues Wireless boards

BluesW.build.core=arduino
BluesW.build.board=BluesWireless
BluesW.build.variant_h=variant_{build.board}.h
BluesW.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
BluesW.build.flash_offset=0x0
BluesW.upload.maximum_size=0
BluesW.upload.maximum_data_size=0

# Swan R5 board
BluesW.menu.pnum.SWAN_R5=Swan R5
BluesW.menu.pnum.SWAN_R5.upload.maximum_size=2097152
BluesW.menu.pnum.SWAN_R5.upload.maximum_data_size=655360
BluesW.menu.pnum.SWAN_R5.build.mcu=cortex-m4
BluesW.menu.pnum.SWAN_R5.build.fpu=-mfpu=fpv4-sp-d16
BluesW.menu.pnum.SWAN_R5.build.float-abi=-mfloat-abi=hard
BluesW.menu.pnum.SWAN_R5.build.board=SWAN_R5
BluesW.menu.pnum.SWAN_R5.build.series=STM32L4xx
BluesW.menu.pnum.SWAN_R5.build.product_line=STM32L4R5xx
BluesW.menu.pnum.SWAN_R5.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY
BluesW.menu.pnum.SWAN_R5.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Upload menu
BluesW.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
BluesW.menu.upload_method.swdMethod.upload.protocol=0
BluesW.menu.upload_method.swdMethod.upload.options=
BluesW.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

BluesW.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
BluesW.menu.upload_method.serialMethod.upload.protocol=1
BluesW.menu.upload_method.serialMethod.upload.options={serial.port.file}
BluesW.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

BluesW.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
BluesW.menu.upload_method.dfuMethod.upload.protocol=2
BluesW.menu.upload_method.dfuMethod.upload.options=
BluesW.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

BluesW.menu.upload_method.swdCmsisDapMethod=OpenOCD (CMSIS-DAP)
BluesW.menu.upload_method.swdCmsisDapMethod.upload.openocd.config=cmsis-dap
# This line is necessary or the error "programmer required to upload" occurs.
BluesW.menu.upload_method.swdCmsisDapMethod.upload.protocol=
BluesW.menu.upload_method.swdCmsisDapMethod.upload.tool=cmsis-dap


################################################################################
# Elecgator boards

Elecgator.name=Elecgator boards

Elecgator.build.core=arduino
Elecgator.build.board=elecgator
Elecgator.build.variant_h=variant_{build.board}.h
Elecgator.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Elecgator.build.flash_offset=0x0
Elecgator.upload.maximum_size=0
Elecgator.upload.maximum_data_size=0

# EtherCATduino board
Elecgator.menu.pnum.ETHERCAT_DUINO=EtherCATduino
Elecgator.menu.pnum.ETHERCAT_DUINO.upload.maximum_size=524288
Elecgator.menu.pnum.ETHERCAT_DUINO.upload.maximum_data_size=327680
Elecgator.menu.pnum.ETHERCAT_DUINO.build.mcu=cortex-m7
Elecgator.menu.pnum.ETHERCAT_DUINO.build.fpu=-mfpu=fpv4-sp-d16
Elecgator.menu.pnum.ETHERCAT_DUINO.build.float-abi=-mfloat-abi=hard
Elecgator.menu.pnum.ETHERCAT_DUINO.build.board=ETHERCAT_DUINO
Elecgator.menu.pnum.ETHERCAT_DUINO.build.series=STM32F7xx
Elecgator.menu.pnum.ETHERCAT_DUINO.build.product_line=STM32F746xx
Elecgator.menu.pnum.ETHERCAT_DUINO.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)
Elecgator.menu.pnum.ETHERCAT_DUINO.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Upload menu
Elecgator.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Elecgator.menu.upload_method.swdMethod.upload.protocol=0
Elecgator.menu.upload_method.swdMethod.upload.options=
Elecgator.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Elecgator.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Elecgator.menu.upload_method.dfuMethod.upload.protocol=2
Elecgator.menu.upload_method.dfuMethod.upload.options=
Elecgator.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Electronic Speed Controller boards

ESC_board.name=Electronic speed controllers

ESC_board.build.core=arduino
ESC_board.build.board=FCE_board
ESC_board.build.variant_h=variant_{build.board}.h
ESC_board.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
ESC_board.build.flash_offset=0x0
ESC_board.upload.maximum_size=0
ESC_board.upload.maximum_data_size=0

# WRAITH32_V1 board
ESC_board.menu.pnum.WRAITH32_V1=Wraith V1 ESC
ESC_board.menu.pnum.WRAITH32_V1.upload.maximum_size=32768
ESC_board.menu.pnum.WRAITH32_V1.upload.maximum_data_size=7936
ESC_board.menu.pnum.WRAITH32_V1.build.mcu=cortex-m0
ESC_board.menu.pnum.WRAITH32_V1.build.board=WRAITH32_V1
ESC_board.menu.pnum.WRAITH32_V1.build.series=STM32F0xx
ESC_board.menu.pnum.WRAITH32_V1.build.product_line=STM32F051x8
ESC_board.menu.pnum.WRAITH32_V1.build.variant=STM32F0xx/F051K(6-8)U
ESC_board.menu.pnum.WRAITH32_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# STORM32_V1_RC board
ESC_board.menu.pnum.STORM32_V1_31_RC=STorM32 BGC v1.31 RC
ESC_board.menu.pnum.STORM32_V1_31_RC.upload.maximum_size=262144
ESC_board.menu.pnum.STORM32_V1_31_RC.upload.maximum_data_size=49152
ESC_board.menu.pnum.STORM32_V1_31_RC.build.mcu=cortex-m3
ESC_board.menu.pnum.STORM32_V1_31_RC.build.board=STORM32_V1_31_RC
ESC_board.menu.pnum.STORM32_V1_31_RC.build.series=STM32F1xx
ESC_board.menu.pnum.STORM32_V1_31_RC.build.product_line=STM32F103xE
ESC_board.menu.pnum.STORM32_V1_31_RC.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
ESC_board.menu.pnum.STORM32_V1_31_RC.build.variant=STM32F1xx/F103R(C-D-E)T

# Upload menu
ESC_board.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
ESC_board.menu.upload_method.swdMethod.upload.protocol=0
ESC_board.menu.upload_method.swdMethod.upload.options=
ESC_board.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
ESC_board.menu.upload_method.serialMethod.upload.protocol=1
ESC_board.menu.upload_method.serialMethod.upload.options={serial.port.file}
ESC_board.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
ESC_board.menu.upload_method.dfuMethod.upload.protocol=2
ESC_board.menu.upload_method.dfuMethod.upload.options=
ESC_board.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Garatronic-McHobby STM32 boards

