stm32duino/Arduino_Core_STM32/boards.txt
GenFlight.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenFlight.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenFlight.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenFlight.menu.upload_method.hidMethod=HID Bootloader 2.2
GenFlight.menu.upload_method.hidMethod.upload.protocol=hid22
GenFlight.menu.upload_method.hidMethod.upload.tool=hid_upload
GenFlight.menu.upload_method.hidMethod.build.flash_offset=0x800
GenFlight.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID

GenFlight.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
GenFlight.menu.upload_method.dfu2Method.upload.protocol=maple
GenFlight.menu.upload_method.dfu2Method.upload.tool=maple_upload
GenFlight.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
GenFlight.menu.upload_method.dfu2Method.upload.altID=2
GenFlight.menu.upload_method.dfu2Method.build.flash_offset=0x2000
GenFlight.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF

GenFlight.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
GenFlight.menu.upload_method.dfuoMethod.upload.protocol=maple
GenFlight.menu.upload_method.dfuoMethod.upload.tool=maple_upload
GenFlight.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
GenFlight.menu.upload_method.dfuoMethod.upload.altID=1
GenFlight.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
GenFlight.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF

################################################################################
# IoT continuum Boards

IotContinuum.name=IoT continuum boards

IotContinuum.build.core=arduino
IotContinuum.build.board=IOT_CONTINUUM
IotContinuum.build.variant_h=variant_{build.board}.h
IotContinuum.build.st_extra_flags=-D{build.product_line} {build.xSerial}
IotContinuum.build.flash_offset=0x0
IotContinuum.upload.maximum_size=0
IotContinuum.upload.maximum_data_size=0

# IoT continuum Dev Kit Board
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM=IoT continuum Dev Kit
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.upload.maximum_size=2097152
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.upload.maximum_data_size=786432
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.mcu=cortex-m33
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.fpu=-mfpu=fpv4-sp-d16
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.float-abi=-mfloat-abi=hard
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.board=DEVKIT_IOT_CONTINUUM
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.series=STM32U5xx
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.product_line=STM32U585xx
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.variant=STM32U5xx/U575C(G-I)(T-U)_U585CI(T-U)
IotContinuum.menu.pnum.DEVKIT_IOT_CONTINUUM.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Upload menu
IotContinuum.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
IotContinuum.menu.upload_method.swdMethod.upload.protocol=0
IotContinuum.menu.upload_method.swdMethod.upload.options=
IotContinuum.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

IotContinuum.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
IotContinuum.menu.upload_method.serialMethod.upload.protocol=1
IotContinuum.menu.upload_method.serialMethod.upload.options={serial.port.file}
IotContinuum.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

IotContinuum.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
IotContinuum.menu.upload_method.dfuMethod.upload.protocol=2
IotContinuum.menu.upload_method.dfuMethod.upload.options=
IotContinuum.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# LoRa boards

LoRa.name=LoRa boards
LoRa.build.core=arduino
LoRa.build.board=LoRa
LoRa.build.variant_h=variant_{build.board}.h
LoRa.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
LoRa.build.flash_offset=0x0
LoRa.upload.maximum_size=0
LoRa.upload.maximum_data_size=0

# ACSIP S76S board
LoRa.menu.pnum.ACSIP_S76S=ACSIP S76S
LoRa.menu.pnum.ACSIP_S76S.upload.maximum_size=196608
LoRa.menu.pnum.ACSIP_S76S.upload.maximum_data_size=20480
LoRa.menu.pnum.ACSIP_S76S.build.mcu=cortex-m0plus
LoRa.menu.pnum.ACSIP_S76S.build.board=ACSIP_S76S
LoRa.menu.pnum.ACSIP_S76S.build.series=STM32L0xx
LoRa.menu.pnum.ACSIP_S76S.build.product_line=STM32L073xx
LoRa.menu.pnum.ACSIP_S76S.build.variant=STM32L0xx/L072R(B-Z)T_L073R(B-Z)T_L083R(B-Z)T
LoRa.menu.pnum.ACSIP_S76S.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.ACSIP_S76S.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# Generic node SE by The Things Industries
LoRa.menu.pnum.GENERIC_NODE_SE_TTI=Generic Node SE (TTI)
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.upload.maximum_size=262144
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.upload.maximum_data_size=65536
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.mcu=cortex-m4
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.board=GENERIC_NODE_SE_TTI
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.series=STM32WLxx
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.product_line=STM32WL55xx
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.variant_h=variant_GENERIC_NODE_SE_TTI.h
LoRa.menu.pnum.GENERIC_NODE_SE_TTI.build.st_extra_flags=-D{build.product_line} -DUSE_CM4_STARTUP_FILE {build.xSerial}

# LORA_E5_MINI board
LoRa.menu.pnum.LORA_E5_MINI=LoRa-E5 mini
LoRa.menu.pnum.LORA_E5_MINI.upload.maximum_size=262144
LoRa.menu.pnum.LORA_E5_MINI.upload.maximum_data_size=65536
LoRa.menu.pnum.LORA_E5_MINI.build.mcu=cortex-m4
LoRa.menu.pnum.LORA_E5_MINI.build.board=LORA_E5_MINI
LoRa.menu.pnum.LORA_E5_MINI.build.series=STM32WLxx
LoRa.menu.pnum.LORA_E5_MINI.build.product_line=STM32WLE5xx
LoRa.menu.pnum.LORA_E5_MINI.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I
LoRa.menu.pnum.LORA_E5_MINI.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.LORA_E5_MINI.build.variant_h=variant_LORA_E5_MINI.h

# RAK3172 module
LoRa.menu.pnum.RAK3172_MODULE=RAK3172 Module
LoRa.menu.pnum.RAK3172_MODULE.upload.maximum_size=262144
LoRa.menu.pnum.RAK3172_MODULE.upload.maximum_data_size=65536
LoRa.menu.pnum.RAK3172_MODULE.build.mcu=cortex-m4
LoRa.menu.pnum.RAK3172_MODULE.build.board=RAK3172_MODULE
LoRa.menu.pnum.RAK3172_MODULE.build.series=STM32WLxx
LoRa.menu.pnum.RAK3172_MODULE.build.product_line=STM32WLE5xx
LoRa.menu.pnum.RAK3172_MODULE.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U
LoRa.menu.pnum.RAK3172_MODULE.build.variant_h=variant_RAK3172_MODULE.h

# RAK811_TRACKER board
LoRa.menu.pnum.RAK811_TRACKER=RAK811 LoRa Tracker (16kb RAM)
LoRa.menu.pnum.RAK811_TRACKER.upload.maximum_size=131072
LoRa.menu.pnum.RAK811_TRACKER.upload.maximum_data_size=16384
LoRa.menu.pnum.RAK811_TRACKER.build.mcu=cortex-m3
LoRa.menu.pnum.RAK811_TRACKER.build.board=RAK811_TRACKER
LoRa.menu.pnum.RAK811_TRACKER.build.series=STM32L1xx
LoRa.menu.pnum.RAK811_TRACKER.build.product_line=STM32L151xB
LoRa.menu.pnum.RAK811_TRACKER.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
LoRa.menu.pnum.RAK811_TRACKER.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

