stm32duino/Arduino_Core_STM32/boards.txt
# SFE_MMPB_STM32WB5MMG board
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG=SparkFun MicroMod STM32WB5MMG
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.upload.maximum_size=827392
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.upload.maximum_data_size=196608
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.mcu=cortex-m4
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.fpu=-mfpu=fpv4-sp-d16
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.float-abi=-mfloat-abi=hard
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.board=SFE_MMPB_STM32WB5MMG
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.series=STM32WBxx
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.product_line=STM32WB5Mxx
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.variant=STM32WBxx/WB5MMGH
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.vid=0x1B4F
SparkFun.menu.pnum.SFE_MMPB_STM32WB5MMG.build.pid=0x0034

# SparkFun MicroMod STM32F405 Board
SparkFun.menu.pnum.MICROMOD_F405=SparkFun MicroMod STM32F405
SparkFun.menu.pnum.MICROMOD_F405.upload.maximum_size=1048576
SparkFun.menu.pnum.MICROMOD_F405.upload.maximum_data_size=131072
SparkFun.menu.pnum.MICROMOD_F405.build.mcu=cortex-m4
SparkFun.menu.pnum.MICROMOD_F405.build.fpu=-mfpu=fpv4-sp-d16
SparkFun.menu.pnum.MICROMOD_F405.build.float-abi=-mfloat-abi=hard
SparkFun.menu.pnum.MICROMOD_F405.build.board=MICROMOD_F405
SparkFun.menu.pnum.MICROMOD_F405.build.series=STM32F4xx
SparkFun.menu.pnum.MICROMOD_F405.build.product_line=STM32F405xx
SparkFun.menu.pnum.MICROMOD_F405.build.variant_h=variant_{build.board}.h
SparkFun.menu.pnum.MICROMOD_F405.build.variant=STM32F4xx/F405RGT_F415RGT
SparkFun.menu.pnum.MICROMOD_F405.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
SparkFun.menu.pnum.MICROMOD_F405.build.vid=0x1B4F
SparkFun.menu.pnum.MICROMOD_F405.build.pid=0x0029

# Upload menu
SparkFun.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
SparkFun.menu.upload_method.swdMethod.upload.protocol=0
SparkFun.menu.upload_method.swdMethod.upload.options=
SparkFun.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

SparkFun.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
SparkFun.menu.upload_method.serialMethod.upload.protocol=1
SparkFun.menu.upload_method.serialMethod.upload.options={serial.port.file}
SparkFun.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

SparkFun.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
SparkFun.menu.upload_method.dfuMethod.upload.protocol=2
SparkFun.menu.upload_method.dfuMethod.upload.options=
SparkFun.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Serialx activation
Nucleo_144.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_144.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_144.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_144.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_144.menu.xserial.disabled.build.xSerial=

Nucleo_64.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_64.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_64.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_64.menu.xserial.disabled.build.xSerial=

Nucleo_32.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_32.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_32.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_32.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_32.menu.xserial.disabled.build.xSerial=

Disco.menu.xserial.generic=Enabled (generic 'Serial')
Disco.menu.xserial.none=Enabled (no generic 'Serial')
Disco.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Disco.menu.xserial.disabled=Disabled (no Serial support)
Disco.menu.xserial.disabled.build.xSerial=

Eval.menu.xserial.generic=Enabled (generic 'Serial')
Eval.menu.xserial.none=Enabled (no generic 'Serial')
Eval.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Eval.menu.xserial.disabled=Disabled (no Serial support)
Eval.menu.xserial.disabled.build.xSerial=

STM32MP1.menu.virtio.disable=Disabled (no SerialVirtIO nor /dev/ttyRPMSG0 available)
STM32MP1.menu.virtio.disable.build.enable_virtio=
STM32MP1.menu.virtio.generic=SerialVirtIO (= generic 'Serial') <=> /dev/ttyRPMSG0
STM32MP1.menu.virtio.generic.build.enable_virtio={build.virtio_flags}
STM32MP1.menu.virtio.enabled=SerialVirtIO <=> /dev/ttyRPMSG0
STM32MP1.menu.virtio.enabled.build.enable_virtio={build.virtio_flags} -DDISABLE_GENERIC_SERIALVIRTIO

STM32MP1.menu.xserial.generic=UART only (generic 'Serial')
STM32MP1.menu.xserial.generic.build.xSerial=-DHAL_UART_MODULE_ENABLED
STM32MP1.menu.xserial.none=UART only (no generic 'Serial')
STM32MP1.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
STM32MP1.menu.xserial.disabled=Disabled (no Serial support)
STM32MP1.menu.xserial.disabled.build.xSerial=

GenC0.menu.xserial.generic=Enabled (generic 'Serial')
GenC0.menu.xserial.none=Enabled (no generic 'Serial')
GenC0.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenC0.menu.xserial.disabled=Disabled (no Serial support)
GenC0.menu.xserial.disabled.build.xSerial=

GenF0.menu.xserial.generic=Enabled (generic 'Serial')
GenF0.menu.xserial.none=Enabled (no generic 'Serial')
GenF0.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF0.menu.xserial.disabled=Disabled (no Serial support)
GenF0.menu.xserial.disabled.build.xSerial=

GenF1.menu.xserial.generic=Enabled (generic 'Serial')
GenF1.menu.xserial.none=Enabled (no generic 'Serial')
GenF1.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF1.menu.xserial.disabled=Disabled (no Serial support)
GenF1.menu.xserial.disabled.build.xSerial=

GenF2.menu.xserial.generic=Enabled (generic 'Serial')
GenF2.menu.xserial.none=Enabled (no generic 'Serial')
GenF2.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF2.menu.xserial.disabled=Disabled (no Serial support)
GenF2.menu.xserial.disabled.build.xSerial=

GenF3.menu.xserial.generic=Enabled (generic 'Serial')
GenF3.menu.xserial.none=Enabled (no generic 'Serial')
GenF3.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF3.menu.xserial.disabled=Disabled (no Serial support)
GenF3.menu.xserial.disabled.build.xSerial=

GenF4.menu.xserial.generic=Enabled (generic 'Serial')
GenF4.menu.xserial.none=Enabled (no generic 'Serial')
GenF4.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF4.menu.xserial.disabled=Disabled (no Serial support)
GenF4.menu.xserial.disabled.build.xSerial=

GenF7.menu.xserial.generic=Enabled (generic 'Serial')
GenF7.menu.xserial.none=Enabled (no generic 'Serial')
GenF7.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF7.menu.xserial.disabled=Disabled (no Serial support)
GenF7.menu.xserial.disabled.build.xSerial=

