stm32duino/Arduino_Core_STM32/boards.txt
GenL0.menu.opt.osstd=Smallest (-Os default)
GenL0.menu.opt.oslto=Smallest (-Os) with LTO
GenL0.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL0.menu.opt.o1std=Fast (-O1)
GenL0.menu.opt.o1std.build.flags.optimize=-O1
GenL0.menu.opt.o1lto=Fast (-O1) with LTO
GenL0.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL0.menu.opt.o2std=Faster (-O2)
GenL0.menu.opt.o2std.build.flags.optimize=-O2
GenL0.menu.opt.o2lto=Faster (-O2) with LTO
GenL0.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL0.menu.opt.o3std=Fastest (-O3)
GenL0.menu.opt.o3std.build.flags.optimize=-O3
GenL0.menu.opt.o3lto=Fastest (-O3) with LTO
GenL0.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL0.menu.opt.ogstd=Debug (-Og)
GenL0.menu.opt.ogstd.build.flags.optimize=-Og
GenL0.menu.opt.o0std=No Optimization (-O0)
GenL0.menu.opt.o0std.build.flags.optimize=-O0

GenL1.menu.opt.osstd=Smallest (-Os default)
GenL1.menu.opt.oslto=Smallest (-Os) with LTO
GenL1.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL1.menu.opt.o1std=Fast (-O1)
GenL1.menu.opt.o1std.build.flags.optimize=-O1
GenL1.menu.opt.o1lto=Fast (-O1) with LTO
GenL1.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL1.menu.opt.o2std=Faster (-O2)
GenL1.menu.opt.o2std.build.flags.optimize=-O2
GenL1.menu.opt.o2lto=Faster (-O2) with LTO
GenL1.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL1.menu.opt.o3std=Fastest (-O3)
GenL1.menu.opt.o3std.build.flags.optimize=-O3
GenL1.menu.opt.o3lto=Fastest (-O3) with LTO
GenL1.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL1.menu.opt.ogstd=Debug (-Og)
GenL1.menu.opt.ogstd.build.flags.optimize=-Og
GenL1.menu.opt.o0std=No Optimization (-O0)
GenL1.menu.opt.o0std.build.flags.optimize=-O0

GenL4.menu.opt.osstd=Smallest (-Os default)
GenL4.menu.opt.oslto=Smallest (-Os) with LTO
GenL4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL4.menu.opt.o1std=Fast (-O1)
GenL4.menu.opt.o1std.build.flags.optimize=-O1
GenL4.menu.opt.o1lto=Fast (-O1) with LTO
GenL4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL4.menu.opt.o2std=Faster (-O2)
GenL4.menu.opt.o2std.build.flags.optimize=-O2
GenL4.menu.opt.o2lto=Faster (-O2) with LTO
GenL4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL4.menu.opt.o3std=Fastest (-O3)
GenL4.menu.opt.o3std.build.flags.optimize=-O3
GenL4.menu.opt.o3lto=Fastest (-O3) with LTO
GenL4.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL4.menu.opt.ogstd=Debug (-Og)
GenL4.menu.opt.ogstd.build.flags.optimize=-Og
GenL4.menu.opt.o0std=No Optimization (-O0)
GenL4.menu.opt.o0std.build.flags.optimize=-O0

GenL5.menu.opt.osstd=Smallest (-Os default)
GenL5.menu.opt.oslto=Smallest (-Os) with LTO
GenL5.menu.opt.oslto.build.flags.optimize=-Os -flto
GenL5.menu.opt.o1std=Fast (-O1)
GenL5.menu.opt.o1std.build.flags.optimize=-O1
GenL5.menu.opt.o1lto=Fast (-O1) with LTO
GenL5.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenL5.menu.opt.o2std=Faster (-O2)
GenL5.menu.opt.o2std.build.flags.optimize=-O2
GenL5.menu.opt.o2lto=Faster (-O2) with LTO
GenL5.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenL5.menu.opt.o3std=Fastest (-O3)
GenL5.menu.opt.o3std.build.flags.optimize=-O3
GenL5.menu.opt.o3lto=Fastest (-O3) with LTO
GenL5.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenL5.menu.opt.ogstd=Debug (-Og)
GenL5.menu.opt.ogstd.build.flags.optimize=-Og
GenL5.menu.opt.o0std=No Optimization (-O0)
GenL5.menu.opt.o0std.build.flags.optimize=-O0

GenU5.menu.opt.osstd=Smallest (-Os default)
GenU5.menu.opt.osstd.build.flags.optimize=-Os
GenU5.menu.opt.oslto=Smallest (-Os) with LTO
GenU5.menu.opt.oslto.build.flags.optimize=-Os -flto
GenU5.menu.opt.o1std=Fast (-O1)
GenU5.menu.opt.o1std.build.flags.optimize=-O1
GenU5.menu.opt.o1lto=Fast (-O1) with LTO
GenU5.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenU5.menu.opt.o2std=Faster (-O2)
GenU5.menu.opt.o2std.build.flags.optimize=-O2
GenU5.menu.opt.o2lto=Faster (-O2) with LTO
GenU5.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenU5.menu.opt.o3std=Fastest (-O3)
GenU5.menu.opt.o3std.build.flags.optimize=-O3
GenU5.menu.opt.o3lto=Fastest (-O3) with LTO
GenU5.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenU5.menu.opt.ogstd=Debug (-Og)
GenU5.menu.opt.ogstd.build.flags.optimize=-Og
GenU5.menu.opt.o0std=No Optimization (-O0)
GenU5.menu.opt.o0std.build.flags.optimize=-O0

GenWB.menu.opt.osstd=Smallest (-Os default)
GenWB.menu.opt.oslto=Smallest (-Os) with LTO
GenWB.menu.opt.oslto.build.flags.optimize=-Os -flto
GenWB.menu.opt.o1std=Fast (-O1)
GenWB.menu.opt.o1std.build.flags.optimize=-O1
GenWB.menu.opt.o1lto=Fast (-O1) with LTO
GenWB.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenWB.menu.opt.o2std=Faster (-O2)
GenWB.menu.opt.o2std.build.flags.optimize=-O2
GenWB.menu.opt.o2lto=Faster (-O2) with LTO
GenWB.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenWB.menu.opt.o3std=Fastest (-O3)
GenWB.menu.opt.o3std.build.flags.optimize=-O3
GenWB.menu.opt.o3lto=Fastest (-O3) with LTO
GenWB.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenWB.menu.opt.ogstd=Debug (-Og)
GenWB.menu.opt.ogstd.build.flags.optimize=-Og
GenWB.menu.opt.o0std=No Optimization (-O0)
GenWB.menu.opt.o0std.build.flags.optimize=-O0

GenWL.menu.opt.osstd=Smallest (-Os default)
GenWL.menu.opt.oslto=Smallest (-Os) with LTO
GenWL.menu.opt.oslto.build.flags.optimize=-Os -flto
GenWL.menu.opt.o1std=Fast (-O1)
GenWL.menu.opt.o1std.build.flags.optimize=-O1
GenWL.menu.opt.o1lto=Fast (-O1) with LTO
GenWL.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenWL.menu.opt.o2std=Faster (-O2)
GenWL.menu.opt.o2std.build.flags.optimize=-O2
GenWL.menu.opt.o2lto=Faster (-O2) with LTO
GenWL.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenWL.menu.opt.o3std=Fastest (-O3)
GenWL.menu.opt.o3std.build.flags.optimize=-O3
GenWL.menu.opt.o3lto=Fastest (-O3) with LTO
GenWL.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenWL.menu.opt.ogstd=Debug (-Og)
GenWL.menu.opt.ogstd.build.flags.optimize=-Og
GenWL.menu.opt.o0std=No Optimization (-O0)
GenWL.menu.opt.o0std.build.flags.optimize=-O0

3dprinter.menu.opt.osstd=Smallest (-Os default)
3dprinter.menu.opt.oslto=Smallest (-Os) with LTO
3dprinter.menu.opt.oslto.build.flags.optimize=-Os -flto
3dprinter.menu.opt.o1std=Fast (-O1)
3dprinter.menu.opt.o1std.build.flags.optimize=-O1
3dprinter.menu.opt.o1lto=Fast (-O1) with LTO
3dprinter.menu.opt.o1lto.build.flags.optimize=-O1 -flto
3dprinter.menu.opt.o2std=Faster (-O2)
3dprinter.menu.opt.o2std.build.flags.optimize=-O2
3dprinter.menu.opt.o2lto=Faster (-O2) with LTO
3dprinter.menu.opt.o2lto.build.flags.optimize=-O2 -flto
3dprinter.menu.opt.o3std=Fastest (-O3)
3dprinter.menu.opt.o3std.build.flags.optimize=-O3
3dprinter.menu.opt.o3lto=Fastest (-O3) with LTO
3dprinter.menu.opt.o3lto.build.flags.optimize=-O3 -flto
3dprinter.menu.opt.ogstd=Debug (-Og)
3dprinter.menu.opt.ogstd.build.flags.optimize=-Og
3dprinter.menu.opt.o0std=No Optimization (-O0)
3dprinter.menu.opt.o0std.build.flags.optimize=-O0

BluesW.menu.opt.osstd=Smallest (-Os default)
BluesW.menu.opt.oslto=Smallest (-Os) with LTO
BluesW.menu.opt.oslto.build.flags.optimize=-Os -flto
BluesW.menu.opt.o1std=Fast (-O1)
BluesW.menu.opt.o1std.build.flags.optimize=-O1
BluesW.menu.opt.o1lto=Fast (-O1) with LTO
BluesW.menu.opt.o1lto.build.flags.optimize=-O1 -flto
BluesW.menu.opt.o2std=Faster (-O2)
BluesW.menu.opt.o2std.build.flags.optimize=-O2
BluesW.menu.opt.o2lto=Faster (-O2) with LTO
BluesW.menu.opt.o2lto.build.flags.optimize=-O2 -flto
BluesW.menu.opt.o3std=Fastest (-O3)
BluesW.menu.opt.o3std.build.flags.optimize=-O3
BluesW.menu.opt.o3lto=Fastest (-O3) with LTO
BluesW.menu.opt.o3lto.build.flags.optimize=-O3 -flto
BluesW.menu.opt.ogstd=Debug (-Og)
BluesW.menu.opt.ogstd.build.flags.optimize=-Og
BluesW.menu.opt.o0std=No Optimization (-O0)
BluesW.menu.opt.o0std.build.flags.optimize=-O0

Elecgator.menu.opt.osstd=Smallest (-Os default)
Elecgator.menu.opt.oslto=Smallest (-Os) with LTO
Elecgator.menu.opt.oslto.build.flags.optimize=-Os -flto
Elecgator.menu.opt.o1std=Fast (-O1)
Elecgator.menu.opt.o1std.build.flags.optimize=-O1
Elecgator.menu.opt.o1lto=Fast (-O1) with LTO
Elecgator.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Elecgator.menu.opt.o2std=Faster (-O2)
Elecgator.menu.opt.o2std.build.flags.optimize=-O2
Elecgator.menu.opt.o2lto=Faster (-O2) with LTO
Elecgator.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Elecgator.menu.opt.o3std=Fastest (-O3)
Elecgator.menu.opt.o3std.build.flags.optimize=-O3
Elecgator.menu.opt.o3lto=Fastest (-O3) with LTO
Elecgator.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Elecgator.menu.opt.ogstd=Debug (-Og)
Elecgator.menu.opt.ogstd.build.flags.optimize=-Og
Elecgator.menu.opt.o0std=No Optimization (-O0)
Elecgator.menu.opt.o0std.build.flags.optimize=-O0

ESC_board.menu.opt.osstd=Smallest (-Os default)
ESC_board.menu.opt.oslto=Smallest (-Os) with LTO
ESC_board.menu.opt.oslto.build.flags.optimize=-Os -flto
ESC_board.menu.opt.o1std=Fast (-O1)
ESC_board.menu.opt.o1std.build.flags.optimize=-O1
ESC_board.menu.opt.o1lto=Fast (-O1) with LTO
ESC_board.menu.opt.o1lto.build.flags.optimize=-O1 -flto
ESC_board.menu.opt.o2std=Faster (-O2)
ESC_board.menu.opt.o2std.build.flags.optimize=-O2
ESC_board.menu.opt.o2lto=Faster (-O2) with LTO
ESC_board.menu.opt.o2lto.build.flags.optimize=-O2 -flto
ESC_board.menu.opt.o3std=Fastest (-O3)
ESC_board.menu.opt.o3std.build.flags.optimize=-O3
ESC_board.menu.opt.o3lto=Fastest (-O3) with LTO
ESC_board.menu.opt.o3lto.build.flags.optimize=-O3 -flto
ESC_board.menu.opt.ogstd=Debug (-Og)
ESC_board.menu.opt.ogstd.build.flags.optimize=-Og
ESC_board.menu.opt.o0std=No Optimization (-O0)
ESC_board.menu.opt.o0std.build.flags.optimize=-O0

Garatronic.menu.opt.osstd=Smallest (-Os default)
Garatronic.menu.opt.oslto=Smallest (-Os) with LTO
Garatronic.menu.opt.oslto.build.flags.optimize=-Os -flto
Garatronic.menu.opt.o1std=Fast (-O1)
Garatronic.menu.opt.o1std.build.flags.optimize=-O1
Garatronic.menu.opt.o1lto=Fast (-O1) with LTO
Garatronic.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Garatronic.menu.opt.o2std=Faster (-O2)
Garatronic.menu.opt.o2std.build.flags.optimize=-O2
Garatronic.menu.opt.o2lto=Faster (-O2) with LTO
Garatronic.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Garatronic.menu.opt.o3std=Fastest (-O3)
Garatronic.menu.opt.o3std.build.flags.optimize=-O3
Garatronic.menu.opt.o3lto=Fastest (-O3) with LTO
Garatronic.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Garatronic.menu.opt.ogstd=Debug (-Og)
Garatronic.menu.opt.ogstd.build.flags.optimize=-Og
Garatronic.menu.opt.o0std=No Optimization (-O0)
Garatronic.menu.opt.o0std.build.flags.optimize=-O0

