stm32duino/Arduino_Core_STM32/boards.txt
GenFlight.menu.rtlib.nano=Newlib Nano (default)
GenFlight.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenFlight.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenFlight.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenFlight.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenFlight.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenFlight.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenFlight.menu.rtlib.full=Newlib Standard
GenFlight.menu.rtlib.full.build.flags.ldspecs=

IotContinuum.menu.rtlib.nano=Newlib Nano (default)
IotContinuum.menu.rtlib.nanofp=Newlib Nano + Float Printf
IotContinuum.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
IotContinuum.menu.rtlib.nanofs=Newlib Nano + Float Scanf
IotContinuum.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
IotContinuum.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
IotContinuum.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
IotContinuum.menu.rtlib.full=Newlib Standard
IotContinuum.menu.rtlib.full.build.flags.ldspecs=

LoRa.menu.rtlib.nano=Newlib Nano (default)
LoRa.menu.rtlib.nanofp=Newlib Nano + Float Printf
LoRa.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
LoRa.menu.rtlib.nanofs=Newlib Nano + Float Scanf
LoRa.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
LoRa.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
LoRa.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
LoRa.menu.rtlib.full=Newlib Standard
LoRa.menu.rtlib.full.build.flags.ldspecs=

Midatronics.menu.rtlib.nano=Newlib Nano (default)
Midatronics.menu.rtlib.nanofp=Newlib Nano + Float Printf
Midatronics.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Midatronics.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Midatronics.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Midatronics.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Midatronics.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Midatronics.menu.rtlib.full=Newlib Standard
Midatronics.menu.rtlib.full.build.flags.ldspecs=

SparkFun.menu.rtlib.nano=Newlib Nano (default)
SparkFun.menu.rtlib.nanofp=Newlib Nano + Float Printf
SparkFun.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
SparkFun.menu.rtlib.nanofs=Newlib Nano + Float Scanf
SparkFun.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
SparkFun.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
SparkFun.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
SparkFun.menu.rtlib.full=Newlib Standard
SparkFun.menu.rtlib.full.build.flags.ldspecs=
